/* automatically generated by rust-bindgen */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>);
impl <T> __IncompleteArrayField<T> {
    #[inline]
    pub fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ptr(&self) -> *const T { ::std::mem::transmute(self) }
    #[inline]
    pub unsafe fn as_mut_ptr(&mut self) -> *mut T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl <T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
impl <T> ::std::clone::Clone for __IncompleteArrayField<T> {
    #[inline]
    fn clone(&self) -> Self { Self::new() }
}
impl <T> ::std::marker::Copy for __IncompleteArrayField<T> { }
#[repr(C)]
pub struct __BindgenUnionField<T>(::std::marker::PhantomData<T>);
impl <T> __BindgenUnionField<T> {
    #[inline]
    pub fn new() -> Self { __BindgenUnionField(::std::marker::PhantomData) }
    #[inline]
    pub unsafe fn as_ref(&self) -> &T { ::std::mem::transmute(self) }
    #[inline]

pub const TPMA_NV_TPMA_NV_WRITTEN: ::std::os::raw::c_uint = 536870912;
pub const TPMA_NV_TPMA_NV_PLATFORMCREATE: ::std::os::raw::c_uint = 1073741824;
pub const TPMA_NV_TPMA_NV_READ_STCLEAR: ::std::os::raw::c_uint = 2147483648;
pub const _SYS_POLL_H: ::std::os::raw::c_uint = 1;
pub const POLLIN: ::std::os::raw::c_uint = 1;
pub const POLLPRI: ::std::os::raw::c_uint = 2;
pub const POLLOUT: ::std::os::raw::c_uint = 4;
pub const POLLRDNORM: ::std::os::raw::c_uint = 64;
pub const POLLRDBAND: ::std::os::raw::c_uint = 128;
pub const POLLWRNORM: ::std::os::raw::c_uint = 256;
pub const POLLWRBAND: ::std::os::raw::c_uint = 512;
pub const POLLERR: ::std::os::raw::c_uint = 8;
pub const POLLHUP: ::std::os::raw::c_uint = 16;
pub const POLLNVAL: ::std::os::raw::c_uint = 32;
pub const TSS2_TCTI_TIMEOUT_BLOCK: ::std::os::raw::c_int = -1;
pub const TSS2_TCTI_TIMEOUT_NONE: ::std::os::raw::c_uint = 0;
pub const TSSWG_INTEROP: ::std::os::raw::c_uint = 1;
pub const MAX_NON_VENDOR_SPECIFIC: ::std::os::raw::c_uint = 536870912;
pub const TSS_SAPI_FIRST_FAMILY: ::std::os::raw::c_uint = 1;
pub const TSS_SAPI_FIRST_LEVEL: ::std::os::raw::c_uint = 1;
pub const TSS_SAPI_FIRST_VERSION: ::std::os::raw::c_uint = 1;
pub const DEFAULT_SIMULATOR_TPM_PORT: ::std::os::raw::c_uint = 2321;
pub const DEFAULT_HOSTNAME: &'static [u8; 10usize] = b"127.0.0.1\x00";
pub const MS_SIM_POWER_ON: ::std::os::raw::c_uint = 1;
pub const MS_SIM_POWER_OFF: ::std::os::raw::c_uint = 2;
pub const MS_SIM_TPM_SEND_COMMAND: ::std::os::raw::c_uint = 8;
pub const MS_SIM_CANCEL_ON: ::std::os::raw::c_uint = 9;
pub const MS_SIM_CANCEL_OFF: ::std::os::raw::c_uint = 10;
pub const MS_SIM_NV_ON: ::std::os::raw::c_uint = 11;
pub const TPM_SESSION_END: ::std::os::raw::c_uint = 20;
pub type wchar_t = ::std::os::raw::c_int;
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_long;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = ::std::os::raw::c_long;
pub type uintmax_t = ::std::os::raw::c_ulong;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum idtype_t { P_ALL = 0, P_PID = 1, P_PGID = 2, }
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    assert_eq!(::std::mem::size_of::<div_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( div_t ) ));
    assert_eq! (::std::mem::align_of::<div_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( div_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const div_t ) ) . quot as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( div_t ) , "::" ,
                stringify ! ( quot ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const div_t ) ) . rem as * const _ as usize } ,
                4usize , concat ! (
                "Alignment of field: " , stringify ! ( div_t ) , "::" ,
                stringify ! ( rem ) ));
}
impl Clone for div_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    assert_eq!(::std::mem::size_of::<ldiv_t>() , 16usize , concat ! (
               "Size of: " , stringify ! ( ldiv_t ) ));
    assert_eq! (::std::mem::align_of::<ldiv_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( ldiv_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ldiv_t ) ) . quot as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ldiv_t ) , "::" ,
                stringify ! ( quot ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ldiv_t ) ) . rem as * const _ as usize }
                , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( ldiv_t ) , "::" ,
                stringify ! ( rem ) ));
}
impl Clone for ldiv_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    assert_eq!(::std::mem::size_of::<lldiv_t>() , 16usize , concat ! (
               "Size of: " , stringify ! ( lldiv_t ) ));
    assert_eq! (::std::mem::align_of::<lldiv_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( lldiv_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lldiv_t ) ) . quot as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( lldiv_t ) , "::" ,
                stringify ! ( quot ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lldiv_t ) ) . rem as * const _ as usize }
                , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( lldiv_t ) , "::" ,
                stringify ! ( rem ) ));
}
impl Clone for lldiv_t {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtod(__nptr: *const ::std::os::raw::c_char,
                  __endptr: *mut *mut ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn strtof(__nptr: *const ::std::os::raw::c_char,
                  __endptr: *mut *mut ::std::os::raw::c_char) -> f32;
}
extern "C" {
    pub fn strtold(__nptr: *const ::std::os::raw::c_char,
                   __endptr: *mut *mut ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn strtol(__nptr: *const ::std::os::raw::c_char,
                  __endptr: *mut *mut ::std::os::raw::c_char,
                  __base: ::std::os::raw::c_int) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoul(__nptr: *const ::std::os::raw::c_char,
                   __endptr: *mut *mut ::std::os::raw::c_char,
                   __base: ::std::os::raw::c_int) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoq(__nptr: *const ::std::os::raw::c_char,
                  __endptr: *mut *mut ::std::os::raw::c_char,
                  __base: ::std::os::raw::c_int)
     -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtouq(__nptr: *const ::std::os::raw::c_char,
                   __endptr: *mut *mut ::std::os::raw::c_char,
                   __base: ::std::os::raw::c_int)
     -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strtoll(__nptr: *const ::std::os::raw::c_char,
                   __endptr: *mut *mut ::std::os::raw::c_char,
                   __base: ::std::os::raw::c_int)
     -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoull(__nptr: *const ::std::os::raw::c_char,
                    __endptr: *mut *mut ::std::os::raw::c_char,
                    __base: ::std::os::raw::c_int)
     -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(::std::mem::size_of::<__fsid_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( __fsid_t ) ));
    assert_eq! (::std::mem::align_of::<__fsid_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( __fsid_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __fsid_t ) ) . __val as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __fsid_t ) , "::" ,
                stringify ! ( __val ) ));
}
impl Clone for __fsid_t {
    fn clone(&self) -> Self { *self }
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __qaddr_t = *mut __quad_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type time_t = __time_t;
pub type clockid_t = __clockid_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulong;
pub type register_t = ::std::os::raw::c_long;
pub type __sig_atomic_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(::std::mem::size_of::<__sigset_t>() , 128usize , concat ! (
               "Size of: " , stringify ! ( __sigset_t ) ));
    assert_eq! (::std::mem::align_of::<__sigset_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( __sigset_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __sigset_t ) ) . __val as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __sigset_t ) , "::" ,
                stringify ! ( __val ) ));
}
impl Clone for __sigset_t {
    fn clone(&self) -> Self { *self }
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(::std::mem::size_of::<timespec>() , 16usize , concat ! (
               "Size of: " , stringify ! ( timespec ) ));
    assert_eq! (::std::mem::align_of::<timespec>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( timespec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timespec ) ) . tv_sec as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( timespec ) , "::" ,
                stringify ! ( tv_sec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timespec ) ) . tv_nsec as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( timespec ) , "::" ,
                stringify ! ( tv_nsec ) ));
}
impl Clone for timespec {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(::std::mem::size_of::<timeval>() , 16usize , concat ! (
               "Size of: " , stringify ! ( timeval ) ));
    assert_eq! (::std::mem::align_of::<timeval>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( timeval ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timeval ) ) . tv_sec as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( timeval ) , "::" ,
                stringify ! ( tv_sec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timeval ) ) . tv_usec as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( timeval ) , "::" ,
                stringify ! ( tv_usec ) ));
}
impl Clone for timeval {
    fn clone(&self) -> Self { *self }
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(::std::mem::size_of::<fd_set>() , 128usize , concat ! (
               "Size of: " , stringify ! ( fd_set ) ));
    assert_eq! (::std::mem::align_of::<fd_set>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( fd_set ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const fd_set ) ) . __fds_bits as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( fd_set ) , "::" ,
                stringify ! ( __fds_bits ) ));
}
impl Clone for fd_set {
    fn clone(&self) -> Self { *self }
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(__nfds: ::std::os::raw::c_int, __readfds: *mut fd_set,
                  __writefds: *mut fd_set, __exceptfds: *mut fd_set,
                  __timeout: *mut timeval) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(__nfds: ::std::os::raw::c_int, __readfds: *mut fd_set,
                   __writefds: *mut fd_set, __exceptfds: *mut fd_set,
                   __timeout: *const timespec, __sigmask: *const __sigset_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gnu_dev_major(__dev: ::std::os::raw::c_ulonglong)
     -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gnu_dev_minor(__dev: ::std::os::raw::c_ulonglong)
     -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gnu_dev_makedev(__major: ::std::os::raw::c_uint,
                           __minor: ::std::os::raw::c_uint)
     -> ::std::os::raw::c_ulonglong;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct pthread_attr_t {
    pub __size: __BindgenUnionField<[::std::os::raw::c_char; 56usize]>,
    pub __align: __BindgenUnionField<::std::os::raw::c_long>,
    pub bindgen_union_field: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(::std::mem::size_of::<pthread_attr_t>() , 56usize , concat ! (
               "Size of: " , stringify ! ( pthread_attr_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_attr_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( pthread_attr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_attr_t ) ) . __size as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_attr_t ) , "::"
                , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_attr_t ) ) . __align as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_attr_t ) , "::"
                , stringify ! ( __align ) ));
}
impl Clone for pthread_attr_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(::std::mem::size_of::<__pthread_internal_list>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( __pthread_internal_list ) ));
    assert_eq! (::std::mem::align_of::<__pthread_internal_list>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( __pthread_internal_list ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_internal_list ) ) . __prev as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_internal_list
                ) , "::" , stringify ! ( __prev ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_internal_list ) ) . __next as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_internal_list
                ) , "::" , stringify ! ( __next ) ));
}
impl Clone for __pthread_internal_list {
    fn clone(&self) -> Self { *self }
}
impl Default for __pthread_internal_list {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct pthread_mutex_t {
    pub __data: __BindgenUnionField<pthread_mutex_t___pthread_mutex_s>,
    pub __size: __BindgenUnionField<[::std::os::raw::c_char; 40usize]>,
    pub __align: __BindgenUnionField<::std::os::raw::c_long>,
    pub bindgen_union_field: [u64; 5usize],
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_mutex_t___pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout_pthread_mutex_t___pthread_mutex_s() {
    assert_eq!(::std::mem::size_of::<pthread_mutex_t___pthread_mutex_s>() ,
               40usize , concat ! (
               "Size of: " , stringify ! ( pthread_mutex_t___pthread_mutex_s )
               ));
    assert_eq! (::std::mem::align_of::<pthread_mutex_t___pthread_mutex_s>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __lock as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __lock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __count as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __owner as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __owner ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __nusers as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __nusers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __kind as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __kind ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __spins as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __spins ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __elision as * const _ as usize } , 22usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __elision ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __list as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __list ) ));
}
impl Clone for pthread_mutex_t___pthread_mutex_s {
    fn clone(&self) -> Self { *self }
}
impl Default for pthread_mutex_t___pthread_mutex_s {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(::std::mem::size_of::<pthread_mutex_t>() , 40usize , concat ! (
               "Size of: " , stringify ! ( pthread_mutex_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_mutex_t>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( pthread_mutex_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t ) ) . __data as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutex_t ) ,
                "::" , stringify ! ( __data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t ) ) . __size as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutex_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t ) ) . __align as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutex_t ) ,
                "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_mutex_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct pthread_mutexattr_t {
    pub __size: __BindgenUnionField<[::std::os::raw::c_char; 4usize]>,
    pub __align: __BindgenUnionField<::std::os::raw::c_int>,
    pub bindgen_union_field: u32,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(::std::mem::size_of::<pthread_mutexattr_t>() , 4usize , concat
               ! ( "Size of: " , stringify ! ( pthread_mutexattr_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_mutexattr_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( pthread_mutexattr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutexattr_t ) ) . __size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutexattr_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutexattr_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutexattr_t ) ,
                "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_mutexattr_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct pthread_cond_t {
    pub __data: __BindgenUnionField<pthread_cond_t__bindgen_ty_1>,
    pub __size: __BindgenUnionField<[::std::os::raw::c_char; 48usize]>,
    pub __align: __BindgenUnionField<::std::os::raw::c_longlong>,
    pub bindgen_union_field: [u64; 6usize],
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_cond_t__bindgen_ty_1 {
    pub __lock: ::std::os::raw::c_int,
    pub __futex: ::std::os::raw::c_uint,
    pub __total_seq: ::std::os::raw::c_ulonglong,
    pub __wakeup_seq: ::std::os::raw::c_ulonglong,
    pub __woken_seq: ::std::os::raw::c_ulonglong,
    pub __mutex: *mut ::std::os::raw::c_void,
    pub __nwaiters: ::std::os::raw::c_uint,
    pub __broadcast_seq: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_pthread_cond_t__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<pthread_cond_t__bindgen_ty_1>() , 48usize
               , concat ! (
               "Size of: " , stringify ! ( pthread_cond_t__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<pthread_cond_t__bindgen_ty_1>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! ( pthread_cond_t__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) . __lock
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! ( __lock )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __futex as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! ( __futex
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __total_seq as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! (
                __total_seq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __wakeup_seq as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! (
                __wakeup_seq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __woken_seq as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! (
                __woken_seq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __mutex as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! ( __mutex
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __nwaiters as * const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! (
                __nwaiters ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __broadcast_seq as * const _ as usize } , 44usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! (
                __broadcast_seq ) ));
}
impl Clone for pthread_cond_t__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for pthread_cond_t__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(::std::mem::size_of::<pthread_cond_t>() , 48usize , concat ! (
               "Size of: " , stringify ! ( pthread_cond_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_cond_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( pthread_cond_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t ) ) . __data as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_cond_t ) , "::"
                , stringify ! ( __data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t ) ) . __size as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_cond_t ) , "::"
                , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t ) ) . __align as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_cond_t ) , "::"
                , stringify ! ( __align ) ));
}
impl Clone for pthread_cond_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct pthread_condattr_t {
    pub __size: __BindgenUnionField<[::std::os::raw::c_char; 4usize]>,
    pub __align: __BindgenUnionField<::std::os::raw::c_int>,
    pub bindgen_union_field: u32,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(::std::mem::size_of::<pthread_condattr_t>() , 4usize , concat !
               ( "Size of: " , stringify ! ( pthread_condattr_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_condattr_t>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( pthread_condattr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_condattr_t ) ) . __size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_condattr_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_condattr_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_condattr_t ) ,
                "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_condattr_t {
    fn clone(&self) -> Self { *self }
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct pthread_rwlock_t {
    pub __data: __BindgenUnionField<pthread_rwlock_t__bindgen_ty_1>,
    pub __size: __BindgenUnionField<[::std::os::raw::c_char; 56usize]>,
    pub __align: __BindgenUnionField<::std::os::raw::c_long>,
    pub bindgen_union_field: [u64; 7usize],
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct pthread_rwlock_t__bindgen_ty_1 {
    pub __lock: ::std::os::raw::c_int,
    pub __nr_readers: ::std::os::raw::c_uint,
    pub __readers_wakeup: ::std::os::raw::c_uint,
    pub __writer_wakeup: ::std::os::raw::c_uint,
    pub __nr_readers_queued: ::std::os::raw::c_uint,
    pub __nr_writers_queued: ::std::os::raw::c_uint,
    pub __writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<pthread_rwlock_t__bindgen_ty_1>() ,
               56usize , concat ! (
               "Size of: " , stringify ! ( pthread_rwlock_t__bindgen_ty_1 )
               ));
    assert_eq! (::std::mem::align_of::<pthread_rwlock_t__bindgen_ty_1>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! ( pthread_rwlock_t__bindgen_ty_1
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __lock as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! ( __lock
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __nr_readers as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __nr_readers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __readers_wakeup as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __readers_wakeup ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __writer_wakeup as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __writer_wakeup ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __nr_readers_queued as * const _ as usize } , 16usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __nr_readers_queued ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __nr_writers_queued as * const _ as usize } , 20usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __nr_writers_queued ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __writer as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __writer ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __shared as * const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __shared ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __rwelision as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __rwelision ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __pad1 as * const _ as usize } , 33usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! ( __pad1
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __pad2 as * const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! ( __pad2
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __flags as * const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __flags ) ));
}
impl Clone for pthread_rwlock_t__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(::std::mem::size_of::<pthread_rwlock_t>() , 56usize , concat !
               ( "Size of: " , stringify ! ( pthread_rwlock_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_rwlock_t>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( pthread_rwlock_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t ) ) . __data as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlock_t ) ,
                "::" , stringify ! ( __data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t ) ) . __size as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlock_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t ) ) . __align as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlock_t ) ,
                "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_rwlock_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct pthread_rwlockattr_t {
    pub __size: __BindgenUnionField<[::std::os::raw::c_char; 8usize]>,
    pub __align: __BindgenUnionField<::std::os::raw::c_long>,
    pub bindgen_union_field: u64,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(::std::mem::size_of::<pthread_rwlockattr_t>() , 8usize , concat
               ! ( "Size of: " , stringify ! ( pthread_rwlockattr_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_rwlockattr_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( pthread_rwlockattr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlockattr_t ) ) . __size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlockattr_t )
                , "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlockattr_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlockattr_t )
                , "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_rwlockattr_t {
    fn clone(&self) -> Self { *self }
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct pthread_barrier_t {
    pub __size: __BindgenUnionField<[::std::os::raw::c_char; 32usize]>,
    pub __align: __BindgenUnionField<::std::os::raw::c_long>,
    pub bindgen_union_field: [u64; 4usize],
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(::std::mem::size_of::<pthread_barrier_t>() , 32usize , concat !
               ( "Size of: " , stringify ! ( pthread_barrier_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_barrier_t>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( pthread_barrier_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_barrier_t ) ) . __size as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_barrier_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_barrier_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_barrier_t ) ,
                "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_barrier_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct pthread_barrierattr_t {
    pub __size: __BindgenUnionField<[::std::os::raw::c_char; 4usize]>,
    pub __align: __BindgenUnionField<::std::os::raw::c_int>,
    pub bindgen_union_field: u32,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(::std::mem::size_of::<pthread_barrierattr_t>() , 4usize ,
               concat ! ( "Size of: " , stringify ! ( pthread_barrierattr_t )
               ));
    assert_eq! (::std::mem::align_of::<pthread_barrierattr_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( pthread_barrierattr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_barrierattr_t ) ) . __size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_barrierattr_t )
                , "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_barrierattr_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_barrierattr_t )
                , "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_barrierattr_t {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn initstate(__seed: ::std::os::raw::c_uint,
                     __statebuf: *mut ::std::os::raw::c_char,
                     __statelen: usize) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[test]
fn bindgen_test_layout_random_data() {
    assert_eq!(::std::mem::size_of::<random_data>() , 48usize , concat ! (
               "Size of: " , stringify ! ( random_data ) ));
    assert_eq! (::std::mem::align_of::<random_data>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( random_data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . fptr as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( fptr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . rptr as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( rptr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . state as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . rand_type as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( rand_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . rand_deg as * const _
                as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( rand_deg ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . rand_sep as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( rand_sep ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . end_ptr as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( end_ptr ) ));
}
impl Clone for random_data {
    fn clone(&self) -> Self { *self }
}
impl Default for random_data {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srandom_r(__seed: ::std::os::raw::c_uint, __buf: *mut random_data)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn initstate_r(__seed: ::std::os::raw::c_uint,
                       __statebuf: *mut ::std::os::raw::c_char,
                       __statelen: usize, __buf: *mut random_data)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setstate_r(__statebuf: *mut ::std::os::raw::c_char,
                      __buf: *mut random_data) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort)
     -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort)
     -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort)
     -> *mut ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_drand48_data() {
    assert_eq!(::std::mem::size_of::<drand48_data>() , 24usize , concat ! (
               "Size of: " , stringify ! ( drand48_data ) ));
    assert_eq! (::std::mem::align_of::<drand48_data>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( drand48_data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const drand48_data ) ) . __x as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( drand48_data ) , "::" ,
                stringify ! ( __x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const drand48_data ) ) . __old_x as * const _
                as usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( drand48_data ) , "::" ,
                stringify ! ( __old_x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const drand48_data ) ) . __c as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( drand48_data ) , "::" ,
                stringify ! ( __c ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const drand48_data ) ) . __init as * const _ as
                usize } , 14usize , concat ! (
                "Alignment of field: " , stringify ! ( drand48_data ) , "::" ,
                stringify ! ( __init ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const drand48_data ) ) . __a as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( drand48_data ) , "::" ,
                stringify ! ( __a ) ));
}
impl Clone for drand48_data {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn erand48_r(__xsubi: *mut ::std::os::raw::c_ushort,
                     __buffer: *mut drand48_data, __result: *mut f64)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrand48_r(__buffer: *mut drand48_data,
                     __result: *mut ::std::os::raw::c_long)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nrand48_r(__xsubi: *mut ::std::os::raw::c_ushort,
                     __buffer: *mut drand48_data,
                     __result: *mut ::std::os::raw::c_long)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mrand48_r(__buffer: *mut drand48_data,
                     __result: *mut ::std::os::raw::c_long)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn jrand48_r(__xsubi: *mut ::std::os::raw::c_ushort,
                     __buffer: *mut drand48_data,
                     __result: *mut ::std::os::raw::c_long)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand48_r(__seedval: ::std::os::raw::c_long,
                     __buffer: *mut drand48_data) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn seed48_r(__seed16v: *mut ::std::os::raw::c_ushort,
                    __buffer: *mut drand48_data) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lcong48_r(__param: *mut ::std::os::raw::c_ushort,
                     __buffer: *mut drand48_data) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn malloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn calloc(__nmemb: usize, __size: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn realloc(__ptr: *mut ::std::os::raw::c_void, __size: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn cfree(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn alloca(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn valloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn posix_memalign(__memptr: *mut *mut ::std::os::raw::c_void,
                          __alignment: usize, __size: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aligned_alloc(__alignment: usize, __size: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn abort();
}
extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn at_quick_exit(__func:
                             ::std::option::Option<unsafe extern "C" fn()>)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn on_exit(__func:
                       ::std::option::Option<unsafe extern "C" fn(__status:
                                                                      ::std::os::raw::c_int,
                                                                  __arg:
                                                                      *mut ::std::os::raw::c_void)>,
                   __arg: *mut ::std::os::raw::c_void)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setenv(__name: *const ::std::os::raw::c_char,
                  __value: *const ::std::os::raw::c_char,
                  __replace: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemps(__template: *mut ::std::os::raw::c_char,
                    __suffixlen: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn realpath(__name: *const ::std::os::raw::c_char,
                    __resolved: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t =
    ::std::option::Option<unsafe extern "C" fn(arg1:
                                                   *const ::std::os::raw::c_void,
                                               arg2:
                                                   *const ::std::os::raw::c_void)
                              -> ::std::os::raw::c_int>;
extern "C" {
    pub fn bsearch(__key: *const ::std::os::raw::c_void,
                   __base: *const ::std::os::raw::c_void, __nmemb: usize,
                   __size: usize, __compar: __compar_fn_t)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn qsort(__base: *mut ::std::os::raw::c_void, __nmemb: usize,
                 __size: usize, __compar: __compar_fn_t);
}
extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong)
     -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int)
     -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long,
                __denom: ::std::os::raw::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(__numer: ::std::os::raw::c_longlong,
                 __denom: ::std::os::raw::c_longlong) -> lldiv_t;
}
extern "C" {
    pub fn ecvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                __decpt: *mut ::std::os::raw::c_int,
                __sign: *mut ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                __decpt: *mut ::std::os::raw::c_int,
                __sign: *mut ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gcvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                __buf: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qecvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                 __decpt: *mut ::std::os::raw::c_int,
                 __sign: *mut ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qfcvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                 __decpt: *mut ::std::os::raw::c_int,
                 __sign: *mut ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qgcvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                 __buf: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ecvt_r(__value: f64, __ndigit: ::std::os::raw::c_int,
                  __decpt: *mut ::std::os::raw::c_int,
                  __sign: *mut ::std::os::raw::c_int,
                  __buf: *mut ::std::os::raw::c_char, __len: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fcvt_r(__value: f64, __ndigit: ::std::os::raw::c_int,
                  __decpt: *mut ::std::os::raw::c_int,
                  __sign: *mut ::std::os::raw::c_int,
                  __buf: *mut ::std::os::raw::c_char, __len: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qecvt_r(__value: f64, __ndigit: ::std::os::raw::c_int,
                   __decpt: *mut ::std::os::raw::c_int,
                   __sign: *mut ::std::os::raw::c_int,
                   __buf: *mut ::std::os::raw::c_char, __len: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qfcvt_r(__value: f64, __ndigit: ::std::os::raw::c_int,
                   __decpt: *mut ::std::os::raw::c_int,
                   __sign: *mut ::std::os::raw::c_int,
                   __buf: *mut ::std::os::raw::c_char, __len: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbtowc(__pwc: *mut wchar_t, __s: *const ::std::os::raw::c_char,
                  __n: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: wchar_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbstowcs(__pwcs: *mut wchar_t, __s: *const ::std::os::raw::c_char,
                    __n: usize) -> usize;
}
extern "C" {
    pub fn wcstombs(__s: *mut ::std::os::raw::c_char, __pwcs: *const wchar_t,
                    __n: usize) -> usize;
}
extern "C" {
    pub fn rpmatch(__response: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsubopt(__optionp: *mut *mut ::std::os::raw::c_char,
                     __tokens: *const *const ::std::os::raw::c_char,
                     __valuep: *mut *mut ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memcpy(__dest: *mut ::std::os::raw::c_void,
                  __src: *const ::std::os::raw::c_void, __n: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memmove(__dest: *mut ::std::os::raw::c_void,
                   __src: *const ::std::os::raw::c_void, __n: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memccpy(__dest: *mut ::std::os::raw::c_void,
                   __src: *const ::std::os::raw::c_void,
                   __c: ::std::os::raw::c_int, __n: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memset(__s: *mut ::std::os::raw::c_void,
                  __c: ::std::os::raw::c_int, __n: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memcmp(__s1: *const ::std::os::raw::c_void,
                  __s2: *const ::std::os::raw::c_void, __n: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memchr(__s: *const ::std::os::raw::c_void,
                  __c: ::std::os::raw::c_int, __n: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strcpy(__dest: *mut ::std::os::raw::c_char,
                  __src: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncpy(__dest: *mut ::std::os::raw::c_char,
                   __src: *const ::std::os::raw::c_char, __n: usize)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcat(__dest: *mut ::std::os::raw::c_char,
                  __src: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncat(__dest: *mut ::std::os::raw::c_char,
                   __src: *const ::std::os::raw::c_char, __n: usize)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcmp(__s1: *const ::std::os::raw::c_char,
                  __s2: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncmp(__s1: *const ::std::os::raw::c_char,
                   __s2: *const ::std::os::raw::c_char, __n: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcoll(__s1: *const ::std::os::raw::c_char,
                   __s2: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm(__dest: *mut ::std::os::raw::c_char,
                   __src: *const ::std::os::raw::c_char, __n: usize)
     -> ::std::os::raw::c_ulong;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    assert_eq!(::std::mem::size_of::<__locale_struct>() , 232usize , concat !
               ( "Size of: " , stringify ! ( __locale_struct ) ));
    assert_eq! (::std::mem::align_of::<__locale_struct>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( __locale_struct ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __locale_struct ) ) . __locales as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __locale_struct ) ,
                "::" , stringify ! ( __locales ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __locale_struct ) ) . __ctype_b as *
                const _ as usize } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( __locale_struct ) ,
                "::" , stringify ! ( __ctype_b ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __locale_struct ) ) . __ctype_tolower as
                * const _ as usize } , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( __locale_struct ) ,
                "::" , stringify ! ( __ctype_tolower ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __locale_struct ) ) . __ctype_toupper as
                * const _ as usize } , 120usize , concat ! (
                "Alignment of field: " , stringify ! ( __locale_struct ) ,
                "::" , stringify ! ( __ctype_toupper ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __locale_struct ) ) . __names as * const
                _ as usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( __locale_struct ) ,
                "::" , stringify ! ( __names ) ));
}
impl Clone for __locale_struct {
    fn clone(&self) -> Self { *self }
}
impl Default for __locale_struct {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn strcoll_l(__s1: *const ::std::os::raw::c_char,
                     __s2: *const ::std::os::raw::c_char, __l: __locale_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm_l(__dest: *mut ::std::os::raw::c_char,
                     __src: *const ::std::os::raw::c_char, __n: usize,
                     __l: __locale_t) -> usize;
}
extern "C" {
    pub fn strdup(__s: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strndup(__string: *const ::std::os::raw::c_char, __n: usize)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strchr(__s: *const ::std::os::raw::c_char,
                  __c: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strrchr(__s: *const ::std::os::raw::c_char,
                   __c: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcspn(__s: *const ::std::os::raw::c_char,
                   __reject: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strspn(__s: *const ::std::os::raw::c_char,
                  __accept: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strpbrk(__s: *const ::std::os::raw::c_char,
                   __accept: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strstr(__haystack: *const ::std::os::raw::c_char,
                  __needle: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok(__s: *mut ::std::os::raw::c_char,
                  __delim: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __strtok_r(__s: *mut ::std::os::raw::c_char,
                      __delim: *const ::std::os::raw::c_char,
                      __save_ptr: *mut *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok_r(__s: *mut ::std::os::raw::c_char,
                    __delim: *const ::std::os::raw::c_char,
                    __save_ptr: *mut *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strlen(__s: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strnlen(__string: *const ::std::os::raw::c_char, __maxlen: usize)
     -> usize;
}
extern "C" {
    pub fn strerror(__errnum: ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "__xpg_strerror_r"]
    pub fn strerror_r(__errnum: ::std::os::raw::c_int,
                      __buf: *mut ::std::os::raw::c_char, __buflen: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strerror_l(__errnum: ::std::os::raw::c_int, __l: __locale_t)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __bzero(__s: *mut ::std::os::raw::c_void, __n: usize);
}
extern "C" {
    pub fn bcopy(__src: *const ::std::os::raw::c_void,
                 __dest: *mut ::std::os::raw::c_void, __n: usize);
}
extern "C" {
    pub fn bzero(__s: *mut ::std::os::raw::c_void, __n: usize);
}
extern "C" {
    pub fn bcmp(__s1: *const ::std::os::raw::c_void,
                __s2: *const ::std::os::raw::c_void, __n: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn index(__s: *const ::std::os::raw::c_char,
                 __c: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn rindex(__s: *const ::std::os::raw::c_char,
                  __c: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ffs(__i: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp(__s1: *const ::std::os::raw::c_char,
                      __s2: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp(__s1: *const ::std::os::raw::c_char,
                       __s2: *const ::std::os::raw::c_char, __n: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strsep(__stringp: *mut *mut ::std::os::raw::c_char,
                  __delim: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strsignal(__sig: ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpcpy(__dest: *mut ::std::os::raw::c_char,
                    __src: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpcpy(__dest: *mut ::std::os::raw::c_char,
                  __src: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpncpy(__dest: *mut ::std::os::raw::c_char,
                     __src: *const ::std::os::raw::c_char, __n: usize)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpncpy(__dest: *mut ::std::os::raw::c_char,
                   __src: *const ::std::os::raw::c_char, __n: usize)
     -> *mut ::std::os::raw::c_char;
}
pub type UINT8 = u8;
pub type BYTE = u8;
pub type INT8 = i8;
pub type BOOL = ::std::os::raw::c_int;
pub type UINT16 = u16;
pub type INT16 = i16;
pub type UINT32 = u32;
pub type INT32 = i32;
pub type UINT64 = u64;
pub type INT64 = i64;
pub type TSS2_RC = UINT32;
/**
 * ABI runetime negotiation structure.
 */
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TSS2_ABI_VERSION {
    pub tssCreator: UINT32,
    pub tssFamily: UINT32,
    pub tssLevel: UINT32,
    pub tssVersion: UINT32,
}
#[test]
fn bindgen_test_layout_TSS2_ABI_VERSION() {
    assert_eq!(::std::mem::size_of::<TSS2_ABI_VERSION>() , 16usize , concat !
               ( "Size of: " , stringify ! ( TSS2_ABI_VERSION ) ));
    assert_eq! (::std::mem::align_of::<TSS2_ABI_VERSION>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( TSS2_ABI_VERSION ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TSS2_ABI_VERSION ) ) . tssCreator as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TSS2_ABI_VERSION ) ,
                "::" , stringify ! ( tssCreator ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TSS2_ABI_VERSION ) ) . tssFamily as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( TSS2_ABI_VERSION ) ,
                "::" , stringify ! ( tssFamily ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TSS2_ABI_VERSION ) ) . tssLevel as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( TSS2_ABI_VERSION ) ,
                "::" , stringify ! ( tssLevel ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TSS2_ABI_VERSION ) ) . tssVersion as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( TSS2_ABI_VERSION ) ,
                "::" , stringify ! ( tssVersion ) ));
}
impl Clone for TSS2_ABI_VERSION {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPM2B {
    pub size: UINT16,
    pub buffer: [BYTE; 1usize],
}
#[test]
fn bindgen_test_layout_TPM2B() {
    assert_eq!(::std::mem::size_of::<TPM2B>() , 4usize , concat ! (
               "Size of: " , stringify ! ( TPM2B ) ));
    assert_eq! (::std::mem::align_of::<TPM2B>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( TPM2B ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B ) ) . size as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B ) , "::" ,
                stringify ! ( size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B ) ) . buffer as * const _ as usize
                } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B ) , "::" ,
                stringify ! ( buffer ) ));
}
impl Clone for TPM2B {
    fn clone(&self) -> Self { *self }
}
pub type TPM_ALG_ID = UINT16;
pub type TPM_ECC_CURVE = UINT16;
pub type TPM_CC = UINT32;
#[repr(C)]
#[derive(Copy)]
pub struct TPM2B_MAX_HASH_BLOCK {
    pub t: __BindgenUnionField<TPM2B_MAX_HASH_BLOCK__bindgen_ty_1>,
    pub b: __BindgenUnionField<TPM2B>,
    pub bindgen_union_field: [u16; 65usize],
}
#[repr(C)]
pub struct TPM2B_MAX_HASH_BLOCK__bindgen_ty_1 {
    pub size: UINT16,
    pub buffer: [BYTE; 128usize],
}
#[test]
fn bindgen_test_layout_TPM2B_MAX_HASH_BLOCK__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<TPM2B_MAX_HASH_BLOCK__bindgen_ty_1>() ,
               130usize , concat ! (
               "Size of: " , stringify ! ( TPM2B_MAX_HASH_BLOCK__bindgen_ty_1
               ) ));
    assert_eq! (::std::mem::align_of::<TPM2B_MAX_HASH_BLOCK__bindgen_ty_1>() ,
                2usize , concat ! (
                "Alignment of " , stringify ! (
                TPM2B_MAX_HASH_BLOCK__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_MAX_HASH_BLOCK__bindgen_ty_1 ) ) .
                size as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_MAX_HASH_BLOCK__bindgen_ty_1 ) , "::" , stringify ! (
                size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_MAX_HASH_BLOCK__bindgen_ty_1 ) ) .
                buffer as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_MAX_HASH_BLOCK__bindgen_ty_1 ) , "::" , stringify ! (
                buffer ) ));
}
impl Default for TPM2B_MAX_HASH_BLOCK__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_TPM2B_MAX_HASH_BLOCK() {
    assert_eq!(::std::mem::size_of::<TPM2B_MAX_HASH_BLOCK>() , 130usize ,
               concat ! ( "Size of: " , stringify ! ( TPM2B_MAX_HASH_BLOCK )
               ));
    assert_eq! (::std::mem::align_of::<TPM2B_MAX_HASH_BLOCK>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPM2B_MAX_HASH_BLOCK ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_MAX_HASH_BLOCK ) ) . t as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_MAX_HASH_BLOCK )
                , "::" , stringify ! ( t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_MAX_HASH_BLOCK ) ) . b as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_MAX_HASH_BLOCK )
                , "::" , stringify ! ( b ) ));
}
impl Clone for TPM2B_MAX_HASH_BLOCK {
    fn clone(&self) -> Self { *self }
}
impl Default for TPM2B_MAX_HASH_BLOCK {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
pub type TPM2B_HASH_BLOCK = TPM2B_MAX_HASH_BLOCK;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPM2B_SEED {
    pub t: __BindgenUnionField<TPM2B_SEED__bindgen_ty_1>,
    pub b: __BindgenUnionField<TPM2B>,
    pub bindgen_union_field: [u16; 17usize],
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPM2B_SEED__bindgen_ty_1 {
    pub size: UINT16,
    pub buffer: [BYTE; 32usize],
}
#[test]
fn bindgen_test_layout_TPM2B_SEED__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<TPM2B_SEED__bindgen_ty_1>() , 34usize ,
               concat ! (
               "Size of: " , stringify ! ( TPM2B_SEED__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<TPM2B_SEED__bindgen_ty_1>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPM2B_SEED__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_SEED__bindgen_ty_1 ) ) . size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_SEED__bindgen_ty_1 ) , "::" , stringify ! ( size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_SEED__bindgen_ty_1 ) ) . buffer as
                * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_SEED__bindgen_ty_1 ) , "::" , stringify ! ( buffer ) ));
}
impl Clone for TPM2B_SEED__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_TPM2B_SEED() {
    assert_eq!(::std::mem::size_of::<TPM2B_SEED>() , 34usize , concat ! (
               "Size of: " , stringify ! ( TPM2B_SEED ) ));
    assert_eq! (::std::mem::align_of::<TPM2B_SEED>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( TPM2B_SEED ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_SEED ) ) . t as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_SEED ) , "::" ,
                stringify ! ( t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_SEED ) ) . b as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_SEED ) , "::" ,
                stringify ! ( b ) ));
}
impl Clone for TPM2B_SEED {
    fn clone(&self) -> Self { *self }
}
pub type TPM_ALGORITHM_ID = UINT32;
pub type TPM_MODIFIER_INDICATOR = UINT32;
pub type TPM_AUTHORIZATION_SIZE = UINT32;
pub type TPM_PARAMETER_SIZE = UINT32;
pub type TPM_KEY_SIZE = UINT16;
pub type TPM_KEY_BITS = UINT16;
pub type TPM_SPEC = UINT32;
pub type TPM_GENERATED = UINT32;
pub type TPM_RC = UINT32;
pub type TPM_CLOCK_ADJUST = INT8;
pub type TPM_EO = UINT16;
pub type TPM_ST = UINT16;
pub type TPM_SU = UINT16;
pub type TPM_SE = UINT8;
pub type TPM_CAP = UINT32;
pub type TPM_PT = UINT32;
pub type TPM_PT_PCR = UINT32;
pub type TPM_PS = UINT32;
pub type TPM_HANDLE = UINT32;
pub type TPM_HT = UINT8;
pub type TPM_RH = TPM_HANDLE;
pub type TPM_HC = TPM_HANDLE;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMA_ALGORITHM {
    pub __bindgen_anon_1: __BindgenUnionField<TPMA_ALGORITHM__bindgen_ty_1>,
    pub val: __BindgenUnionField<UINT32>,
    pub bindgen_union_field: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMA_ALGORITHM__bindgen_ty_1 {
    pub _bitfield_1: u32,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_TPMA_ALGORITHM__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<TPMA_ALGORITHM__bindgen_ty_1>() , 4usize
               , concat ! (
               "Size of: " , stringify ! ( TPMA_ALGORITHM__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<TPMA_ALGORITHM__bindgen_ty_1>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! ( TPMA_ALGORITHM__bindgen_ty_1 )
                ));
}
impl Clone for TPMA_ALGORITHM__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl TPMA_ALGORITHM__bindgen_ty_1 {
    #[inline]
    pub fn asymmetric(&self) -> ::std::os::raw::c_uint {
        let mask = 1usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_asymmetric(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 1usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn symmetric(&self) -> ::std::os::raw::c_uint {
        let mask = 2usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 1usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_symmetric(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 2usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 1usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn hash(&self) -> ::std::os::raw::c_uint {
        let mask = 4usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 2usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_hash(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 4usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 2usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn object(&self) -> ::std::os::raw::c_uint {
        let mask = 8usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 3usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_object(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 8usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 3usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn reserved1(&self) -> ::std::os::raw::c_uint {
        let mask = 240usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 4usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_reserved1(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 240usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 4usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn signing(&self) -> ::std::os::raw::c_uint {
        let mask = 256usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 8usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_signing(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 256usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 8usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn encrypting(&self) -> ::std::os::raw::c_uint {
        let mask = 512usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 9usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_encrypting(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 512usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 9usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn method(&self) -> ::std::os::raw::c_uint {
        let mask = 1024usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 10usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_method(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 1024usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 10usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn reserved2(&self) -> ::std::os::raw::c_uint {
        let mask = 4294965248usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 11usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_reserved2(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 4294965248usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 11usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn new_bitfield_1(asymmetric: ::std::os::raw::c_uint,
                          symmetric: ::std::os::raw::c_uint,
                          hash: ::std::os::raw::c_uint,
                          object: ::std::os::raw::c_uint,
                          reserved1: ::std::os::raw::c_uint,
                          signing: ::std::os::raw::c_uint,
                          encrypting: ::std::os::raw::c_uint,
                          method: ::std::os::raw::c_uint,
                          reserved2: ::std::os::raw::c_uint) -> u32 {
        ({
             ({
                  ({
                       ({
                            ({
                                 ({
                                      ({
                                           ({
                                                ({ 0 } |
                                                     ((asymmetric as u32 as
                                                           u32) << 0usize) &
                                                         (1usize as u32))
                                            } |
                                                ((symmetric as u32 as u32) <<
                                                     1usize) &
                                                    (2usize as u32))
                                       } |
                                           ((hash as u32 as u32) << 2usize) &
                                               (4usize as u32))
                                  } |
                                      ((object as u32 as u32) << 3usize) &
                                          (8usize as u32))
                             } |
                                 ((reserved1 as u32 as u32) << 4usize) &
                                     (240usize as u32))
                        } |
                            ((signing as u32 as u32) << 8usize) &
                                (256usize as u32))
                   } |
                       ((encrypting as u32 as u32) << 9usize) &
                           (512usize as u32))
              } | ((method as u32 as u32) << 10usize) & (1024usize as u32))
         } |
             ((reserved2 as u32 as u32) << 11usize) &
                 (4294965248usize as u32))
    }
}
#[test]
fn bindgen_test_layout_TPMA_ALGORITHM() {
    assert_eq!(::std::mem::size_of::<TPMA_ALGORITHM>() , 4usize , concat ! (
               "Size of: " , stringify ! ( TPMA_ALGORITHM ) ));
    assert_eq! (::std::mem::align_of::<TPMA_ALGORITHM>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( TPMA_ALGORITHM ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMA_ALGORITHM ) ) . val as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMA_ALGORITHM ) , "::"
                , stringify ! ( val ) ));
}
impl Clone for TPMA_ALGORITHM {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMA_OBJECT {
    pub __bindgen_anon_1: __BindgenUnionField<TPMA_OBJECT__bindgen_ty_1>,
    pub val: __BindgenUnionField<UINT32>,
    pub bindgen_union_field: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMA_OBJECT__bindgen_ty_1 {
    pub _bitfield_1: [u16; 2usize],
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_TPMA_OBJECT__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<TPMA_OBJECT__bindgen_ty_1>() , 4usize ,
               concat ! (
               "Size of: " , stringify ! ( TPMA_OBJECT__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<TPMA_OBJECT__bindgen_ty_1>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPMA_OBJECT__bindgen_ty_1 )
                ));
}
impl Clone for TPMA_OBJECT__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl TPMA_OBJECT__bindgen_ty_1 {
    #[inline]
    pub fn reserved1(&self) -> ::std::os::raw::c_uint {
        let mask = 1usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_reserved1(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 1usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn fixedTPM(&self) -> ::std::os::raw::c_uint {
        let mask = 2usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 1usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_fixedTPM(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 2usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 1usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn stClear(&self) -> ::std::os::raw::c_uint {
        let mask = 4usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 2usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_stClear(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 4usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 2usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn reserved2(&self) -> ::std::os::raw::c_uint {
        let mask = 8usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 3usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_reserved2(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 8usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 3usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn fixedParent(&self) -> ::std::os::raw::c_uint {
        let mask = 16usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 4usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_fixedParent(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 16usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 4usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn sensitiveDataOrigin(&self) -> ::std::os::raw::c_uint {
        let mask = 32usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 5usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_sensitiveDataOrigin(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 32usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 5usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn userWithAuth(&self) -> ::std::os::raw::c_uint {
        let mask = 64usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 6usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_userWithAuth(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 64usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 6usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn adminWithPolicy(&self) -> ::std::os::raw::c_uint {
        let mask = 128usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 7usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_adminWithPolicy(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 128usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 7usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn reserved3(&self) -> ::std::os::raw::c_uint {
        let mask = 768usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 8usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_reserved3(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 768usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 8usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn noDA(&self) -> ::std::os::raw::c_uint {
        let mask = 1024usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 10usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_noDA(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 1024usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 10usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn encryptedDuplication(&self) -> ::std::os::raw::c_uint {
        let mask = 2048usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 11usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_encryptedDuplication(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 2048usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 11usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn reserved4(&self) -> ::std::os::raw::c_uint {
        let mask = 61440usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 12usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_reserved4(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 61440usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 12usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn restricted(&self) -> ::std::os::raw::c_uint {
        let mask = 65536usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 16usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_restricted(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 65536usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 16usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn decrypt(&self) -> ::std::os::raw::c_uint {
        let mask = 131072usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 17usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_decrypt(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 131072usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 17usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn sign(&self) -> ::std::os::raw::c_uint {
        let mask = 262144usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 18usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_sign(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 262144usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 18usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn reserved5(&self) -> ::std::os::raw::c_uint {
        let mask = 4294443008usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 19usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_reserved5(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 4294443008usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 19usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn new_bitfield_1(reserved1: ::std::os::raw::c_uint,
                          fixedTPM: ::std::os::raw::c_uint,
                          stClear: ::std::os::raw::c_uint,
                          reserved2: ::std::os::raw::c_uint,
                          fixedParent: ::std::os::raw::c_uint,
                          sensitiveDataOrigin: ::std::os::raw::c_uint,
                          userWithAuth: ::std::os::raw::c_uint,
                          adminWithPolicy: ::std::os::raw::c_uint,
                          reserved3: ::std::os::raw::c_uint,
                          noDA: ::std::os::raw::c_uint,
                          encryptedDuplication: ::std::os::raw::c_uint,
                          reserved4: ::std::os::raw::c_uint,
                          restricted: ::std::os::raw::c_uint,
                          decrypt: ::std::os::raw::c_uint,
                          sign: ::std::os::raw::c_uint,
                          reserved5: ::std::os::raw::c_uint) -> u32 {
        ({
             ({
                  ({
                       ({
                            ({
                                 ({
                                      ({
                                           ({
                                                ({
                                                     ({
                                                          ({
                                                               ({
                                                                    ({
                                                                         ({
                                                                              ({
                                                                                   ({
                                                                                        0
                                                                                    }
                                                                                        |
                                                                                        ((reserved1
                                                                                              as
                                                                                              u32
                                                                                              as
                                                                                              u32)
                                                                                             <<
                                                                                             0usize)
                                                                                            &
                                                                                            (1usize
                                                                                                 as
                                                                                                 u32))
                                                                               }
                                                                                   |
                                                                                   ((fixedTPM
                                                                                         as
                                                                                         u32
                                                                                         as
                                                                                         u32)
                                                                                        <<
                                                                                        1usize)
                                                                                       &
                                                                                       (2usize
                                                                                            as
                                                                                            u32))
                                                                          } |
                                                                              ((stClear
                                                                                    as
                                                                                    u32
                                                                                    as
                                                                                    u32)
                                                                                   <<
                                                                                   2usize)
                                                                                  &
                                                                                  (4usize
                                                                                       as
                                                                                       u32))
                                                                     } |
                                                                         ((reserved2
                                                                               as
                                                                               u32
                                                                               as
                                                                               u32)
                                                                              <<
                                                                              3usize)
                                                                             &
                                                                             (8usize
                                                                                  as
                                                                                  u32))
                                                                } |
                                                                    ((fixedParent
                                                                          as
                                                                          u32
                                                                          as
                                                                          u32)
                                                                         <<
                                                                         4usize)
                                                                        &
                                                                        (16usize
                                                                             as
                                                                             u32))
                                                           } |
                                                               ((sensitiveDataOrigin
                                                                     as u32 as
                                                                     u32) <<
                                                                    5usize) &
                                                                   (32usize as
                                                                        u32))
                                                      } |
                                                          ((userWithAuth as
                                                                u32 as u32) <<
                                                               6usize) &
                                                              (64usize as
                                                                   u32))
                                                 } |
                                                     ((adminWithPolicy as u32
                                                           as u32) << 7usize)
                                                         & (128usize as u32))
                                            } |
                                                ((reserved3 as u32 as u32) <<
                                                     8usize) &
                                                    (768usize as u32))
                                       } |
                                           ((noDA as u32 as u32) << 10usize) &
                                               (1024usize as u32))
                                  } |
                                      ((encryptedDuplication as u32 as u32) <<
                                           11usize) & (2048usize as u32))
                             } |
                                 ((reserved4 as u32 as u32) << 12usize) &
                                     (61440usize as u32))
                        } |
                            ((restricted as u32 as u32) << 16usize) &
                                (65536usize as u32))
                   } |
                       ((decrypt as u32 as u32) << 17usize) &
                           (131072usize as u32))
              } | ((sign as u32 as u32) << 18usize) & (262144usize as u32))
         } |
             ((reserved5 as u32 as u32) << 19usize) &
                 (4294443008usize as u32))
    }
}
#[test]
fn bindgen_test_layout_TPMA_OBJECT() {
    assert_eq!(::std::mem::size_of::<TPMA_OBJECT>() , 4usize , concat ! (
               "Size of: " , stringify ! ( TPMA_OBJECT ) ));
    assert_eq! (::std::mem::align_of::<TPMA_OBJECT>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( TPMA_OBJECT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMA_OBJECT ) ) . val as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMA_OBJECT ) , "::" ,
                stringify ! ( val ) ));
}
impl Clone for TPMA_OBJECT {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMA_SESSION {
    pub __bindgen_anon_1: __BindgenUnionField<TPMA_SESSION__bindgen_ty_1>,
    pub val: __BindgenUnionField<UINT32>,
    pub bindgen_union_field: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMA_SESSION__bindgen_ty_1 {
    pub _bitfield_1: u8,
    pub __bindgen_padding_0: [u8; 3usize],
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_TPMA_SESSION__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<TPMA_SESSION__bindgen_ty_1>() , 4usize ,
               concat ! (
               "Size of: " , stringify ! ( TPMA_SESSION__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<TPMA_SESSION__bindgen_ty_1>() , 4usize
                , concat ! (
                "Alignment of " , stringify ! ( TPMA_SESSION__bindgen_ty_1 )
                ));
}
impl Clone for TPMA_SESSION__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl TPMA_SESSION__bindgen_ty_1 {
    #[inline]
    pub fn continueSession(&self) -> ::std::os::raw::c_uint {
        let mask = 1usize as u8;
        let unit_field_val: u8 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_continueSession(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 1usize as u8;
        let val = val as u32 as u8;
        let mut unit_field_val: u8 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn auditExclusive(&self) -> ::std::os::raw::c_uint {
        let mask = 2usize as u8;
        let unit_field_val: u8 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 1usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_auditExclusive(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 2usize as u8;
        let val = val as u32 as u8;
        let mut unit_field_val: u8 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 1usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn auditReset(&self) -> ::std::os::raw::c_uint {
        let mask = 4usize as u8;
        let unit_field_val: u8 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 2usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_auditReset(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 4usize as u8;
        let val = val as u32 as u8;
        let mut unit_field_val: u8 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 2usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn reserved1(&self) -> ::std::os::raw::c_uint {
        let mask = 24usize as u8;
        let unit_field_val: u8 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 3usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_reserved1(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 24usize as u8;
        let val = val as u32 as u8;
        let mut unit_field_val: u8 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 3usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn decrypt(&self) -> ::std::os::raw::c_uint {
        let mask = 32usize as u8;
        let unit_field_val: u8 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 5usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_decrypt(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 32usize as u8;
        let val = val as u32 as u8;
        let mut unit_field_val: u8 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 5usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn encrypt(&self) -> ::std::os::raw::c_uint {
        let mask = 64usize as u8;
        let unit_field_val: u8 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 6usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_encrypt(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 64usize as u8;
        let val = val as u32 as u8;
        let mut unit_field_val: u8 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 6usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn audit(&self) -> ::std::os::raw::c_uint {
        let mask = 128usize as u8;
        let unit_field_val: u8 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 7usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_audit(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 128usize as u8;
        let val = val as u32 as u8;
        let mut unit_field_val: u8 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 7usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn new_bitfield_1(continueSession: ::std::os::raw::c_uint,
                          auditExclusive: ::std::os::raw::c_uint,
                          auditReset: ::std::os::raw::c_uint,
                          reserved1: ::std::os::raw::c_uint,
                          decrypt: ::std::os::raw::c_uint,
                          encrypt: ::std::os::raw::c_uint,
                          audit: ::std::os::raw::c_uint) -> u8 {
        ({
             ({
                  ({
                       ({
                            ({
                                 ({
                                      ({ 0 } |
                                           ((continueSession as u32 as u8) <<
                                                0usize) & (1usize as u8))
                                  } |
                                      ((auditExclusive as u32 as u8) <<
                                           1usize) & (2usize as u8))
                             } |
                                 ((auditReset as u32 as u8) << 2usize) &
                                     (4usize as u8))
                        } |
                            ((reserved1 as u32 as u8) << 3usize) &
                                (24usize as u8))
                   } | ((decrypt as u32 as u8) << 5usize) & (32usize as u8))
              } | ((encrypt as u32 as u8) << 6usize) & (64usize as u8))
         } | ((audit as u32 as u8) << 7usize) & (128usize as u8))
    }
}
#[test]
fn bindgen_test_layout_TPMA_SESSION() {
    assert_eq!(::std::mem::size_of::<TPMA_SESSION>() , 4usize , concat ! (
               "Size of: " , stringify ! ( TPMA_SESSION ) ));
    assert_eq! (::std::mem::align_of::<TPMA_SESSION>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( TPMA_SESSION ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMA_SESSION ) ) . val as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMA_SESSION ) , "::" ,
                stringify ! ( val ) ));
}
impl Clone for TPMA_SESSION {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMA_LOCALITY {
    pub __bindgen_anon_1: __BindgenUnionField<TPMA_LOCALITY__bindgen_ty_1>,
    pub val: __BindgenUnionField<UINT32>,
    pub bindgen_union_field: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMA_LOCALITY__bindgen_ty_1 {
    pub _bitfield_1: u8,
    pub __bindgen_padding_0: [u8; 3usize],
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_TPMA_LOCALITY__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<TPMA_LOCALITY__bindgen_ty_1>() , 4usize ,
               concat ! (
               "Size of: " , stringify ! ( TPMA_LOCALITY__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<TPMA_LOCALITY__bindgen_ty_1>() , 4usize
                , concat ! (
                "Alignment of " , stringify ! ( TPMA_LOCALITY__bindgen_ty_1 )
                ));
}
impl Clone for TPMA_LOCALITY__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl TPMA_LOCALITY__bindgen_ty_1 {
    #[inline]
    pub fn TPM_LOC_ZERO(&self) -> ::std::os::raw::c_uint {
        let mask = 1usize as u8;
        let unit_field_val: u8 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_TPM_LOC_ZERO(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 1usize as u8;
        let val = val as u32 as u8;
        let mut unit_field_val: u8 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn TPM_LOC_ONE(&self) -> ::std::os::raw::c_uint {
        let mask = 2usize as u8;
        let unit_field_val: u8 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 1usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_TPM_LOC_ONE(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 2usize as u8;
        let val = val as u32 as u8;
        let mut unit_field_val: u8 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 1usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn TPM_LOC_TWO(&self) -> ::std::os::raw::c_uint {
        let mask = 4usize as u8;
        let unit_field_val: u8 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 2usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_TPM_LOC_TWO(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 4usize as u8;
        let val = val as u32 as u8;
        let mut unit_field_val: u8 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 2usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn TPM_LOC_THREE(&self) -> ::std::os::raw::c_uint {
        let mask = 8usize as u8;
        let unit_field_val: u8 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 3usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_TPM_LOC_THREE(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 8usize as u8;
        let val = val as u32 as u8;
        let mut unit_field_val: u8 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 3usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn TPM_LOC_FOUR(&self) -> ::std::os::raw::c_uint {
        let mask = 16usize as u8;
        let unit_field_val: u8 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 4usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_TPM_LOC_FOUR(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 16usize as u8;
        let val = val as u32 as u8;
        let mut unit_field_val: u8 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 4usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn Extended(&self) -> ::std::os::raw::c_uint {
        let mask = 224usize as u8;
        let unit_field_val: u8 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 5usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_Extended(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 224usize as u8;
        let val = val as u32 as u8;
        let mut unit_field_val: u8 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 5usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn new_bitfield_1(TPM_LOC_ZERO: ::std::os::raw::c_uint,
                          TPM_LOC_ONE: ::std::os::raw::c_uint,
                          TPM_LOC_TWO: ::std::os::raw::c_uint,
                          TPM_LOC_THREE: ::std::os::raw::c_uint,
                          TPM_LOC_FOUR: ::std::os::raw::c_uint,
                          Extended: ::std::os::raw::c_uint) -> u8 {
        ({
             ({
                  ({
                       ({
                            ({
                                 ({ 0 } |
                                      ((TPM_LOC_ZERO as u32 as u8) << 0usize)
                                          & (1usize as u8))
                             } |
                                 ((TPM_LOC_ONE as u32 as u8) << 1usize) &
                                     (2usize as u8))
                        } |
                            ((TPM_LOC_TWO as u32 as u8) << 2usize) &
                                (4usize as u8))
                   } |
                       ((TPM_LOC_THREE as u32 as u8) << 3usize) &
                           (8usize as u8))
              } | ((TPM_LOC_FOUR as u32 as u8) << 4usize) & (16usize as u8))
         } | ((Extended as u32 as u8) << 5usize) & (224usize as u8))
    }
}
#[test]
fn bindgen_test_layout_TPMA_LOCALITY() {
    assert_eq!(::std::mem::size_of::<TPMA_LOCALITY>() , 4usize , concat ! (
               "Size of: " , stringify ! ( TPMA_LOCALITY ) ));
    assert_eq! (::std::mem::align_of::<TPMA_LOCALITY>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( TPMA_LOCALITY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMA_LOCALITY ) ) . val as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMA_LOCALITY ) , "::"
                , stringify ! ( val ) ));
}
impl Clone for TPMA_LOCALITY {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMA_PERMANENT {
    pub __bindgen_anon_1: __BindgenUnionField<TPMA_PERMANENT__bindgen_ty_1>,
    pub val: __BindgenUnionField<UINT32>,
    pub bindgen_union_field: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMA_PERMANENT__bindgen_ty_1 {
    pub _bitfield_1: u32,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_TPMA_PERMANENT__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<TPMA_PERMANENT__bindgen_ty_1>() , 4usize
               , concat ! (
               "Size of: " , stringify ! ( TPMA_PERMANENT__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<TPMA_PERMANENT__bindgen_ty_1>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! ( TPMA_PERMANENT__bindgen_ty_1 )
                ));
}
impl Clone for TPMA_PERMANENT__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl TPMA_PERMANENT__bindgen_ty_1 {
    #[inline]
    pub fn ownerAuthSet(&self) -> ::std::os::raw::c_uint {
        let mask = 1usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_ownerAuthSet(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 1usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn endorsementAuthSet(&self) -> ::std::os::raw::c_uint {
        let mask = 2usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 1usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_endorsementAuthSet(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 2usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 1usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn lockoutAuthSet(&self) -> ::std::os::raw::c_uint {
        let mask = 4usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 2usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_lockoutAuthSet(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 4usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 2usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn reserved1(&self) -> ::std::os::raw::c_uint {
        let mask = 248usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 3usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_reserved1(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 248usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 3usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn disableClear(&self) -> ::std::os::raw::c_uint {
        let mask = 256usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 8usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_disableClear(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 256usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 8usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn inLockout(&self) -> ::std::os::raw::c_uint {
        let mask = 512usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 9usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_inLockout(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 512usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 9usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn tpmGeneratedEPS(&self) -> ::std::os::raw::c_uint {
        let mask = 1024usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 10usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_tpmGeneratedEPS(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 1024usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 10usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn reserved2(&self) -> ::std::os::raw::c_uint {
        let mask = 4294965248usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 11usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_reserved2(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 4294965248usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 11usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn new_bitfield_1(ownerAuthSet: ::std::os::raw::c_uint,
                          endorsementAuthSet: ::std::os::raw::c_uint,
                          lockoutAuthSet: ::std::os::raw::c_uint,
                          reserved1: ::std::os::raw::c_uint,
                          disableClear: ::std::os::raw::c_uint,
                          inLockout: ::std::os::raw::c_uint,
                          tpmGeneratedEPS: ::std::os::raw::c_uint,
                          reserved2: ::std::os::raw::c_uint) -> u32 {
        ({
             ({
                  ({
                       ({
                            ({
                                 ({
                                      ({
                                           ({ 0 } |
                                                ((ownerAuthSet as u32 as u32)
                                                     << 0usize) &
                                                    (1usize as u32))
                                       } |
                                           ((endorsementAuthSet as u32 as u32)
                                                << 1usize) & (2usize as u32))
                                  } |
                                      ((lockoutAuthSet as u32 as u32) <<
                                           2usize) & (4usize as u32))
                             } |
                                 ((reserved1 as u32 as u32) << 3usize) &
                                     (248usize as u32))
                        } |
                            ((disableClear as u32 as u32) << 8usize) &
                                (256usize as u32))
                   } |
                       ((inLockout as u32 as u32) << 9usize) &
                           (512usize as u32))
              } |
                  ((tpmGeneratedEPS as u32 as u32) << 10usize) &
                      (1024usize as u32))
         } |
             ((reserved2 as u32 as u32) << 11usize) &
                 (4294965248usize as u32))
    }
}
#[test]
fn bindgen_test_layout_TPMA_PERMANENT() {
    assert_eq!(::std::mem::size_of::<TPMA_PERMANENT>() , 4usize , concat ! (
               "Size of: " , stringify ! ( TPMA_PERMANENT ) ));
    assert_eq! (::std::mem::align_of::<TPMA_PERMANENT>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( TPMA_PERMANENT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMA_PERMANENT ) ) . val as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMA_PERMANENT ) , "::"
                , stringify ! ( val ) ));
}
impl Clone for TPMA_PERMANENT {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMA_STARTUP_CLEAR {
    pub __bindgen_anon_1: __BindgenUnionField<TPMA_STARTUP_CLEAR__bindgen_ty_1>,
    pub val: __BindgenUnionField<UINT32>,
    pub bindgen_union_field: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMA_STARTUP_CLEAR__bindgen_ty_1 {
    pub _bitfield_1: u32,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_TPMA_STARTUP_CLEAR__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<TPMA_STARTUP_CLEAR__bindgen_ty_1>() ,
               4usize , concat ! (
               "Size of: " , stringify ! ( TPMA_STARTUP_CLEAR__bindgen_ty_1 )
               ));
    assert_eq! (::std::mem::align_of::<TPMA_STARTUP_CLEAR__bindgen_ty_1>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! (
                TPMA_STARTUP_CLEAR__bindgen_ty_1 ) ));
}
impl Clone for TPMA_STARTUP_CLEAR__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl TPMA_STARTUP_CLEAR__bindgen_ty_1 {
    #[inline]
    pub fn phEnable(&self) -> ::std::os::raw::c_uint {
        let mask = 1usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_phEnable(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 1usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn shEnable(&self) -> ::std::os::raw::c_uint {
        let mask = 2usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 1usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_shEnable(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 2usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 1usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn ehEnable(&self) -> ::std::os::raw::c_uint {
        let mask = 4usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 2usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_ehEnable(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 4usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 2usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn phEnableNV(&self) -> ::std::os::raw::c_uint {
        let mask = 8usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 3usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_phEnableNV(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 8usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 3usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn reserved1(&self) -> ::std::os::raw::c_uint {
        let mask = 2147483632usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 4usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_reserved1(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 2147483632usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 4usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn orderly(&self) -> ::std::os::raw::c_uint {
        let mask = 2147483648usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 31usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_orderly(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 2147483648usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 31usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn new_bitfield_1(phEnable: ::std::os::raw::c_uint,
                          shEnable: ::std::os::raw::c_uint,
                          ehEnable: ::std::os::raw::c_uint,
                          phEnableNV: ::std::os::raw::c_uint,
                          reserved1: ::std::os::raw::c_uint,
                          orderly: ::std::os::raw::c_uint) -> u32 {
        ({
             ({
                  ({
                       ({
                            ({
                                 ({ 0 } |
                                      ((phEnable as u32 as u32) << 0usize) &
                                          (1usize as u32))
                             } |
                                 ((shEnable as u32 as u32) << 1usize) &
                                     (2usize as u32))
                        } |
                            ((ehEnable as u32 as u32) << 2usize) &
                                (4usize as u32))
                   } |
                       ((phEnableNV as u32 as u32) << 3usize) &
                           (8usize as u32))
              } |
                  ((reserved1 as u32 as u32) << 4usize) &
                      (2147483632usize as u32))
         } | ((orderly as u32 as u32) << 31usize) & (2147483648usize as u32))
    }
}
#[test]
fn bindgen_test_layout_TPMA_STARTUP_CLEAR() {
    assert_eq!(::std::mem::size_of::<TPMA_STARTUP_CLEAR>() , 4usize , concat !
               ( "Size of: " , stringify ! ( TPMA_STARTUP_CLEAR ) ));
    assert_eq! (::std::mem::align_of::<TPMA_STARTUP_CLEAR>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( TPMA_STARTUP_CLEAR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMA_STARTUP_CLEAR ) ) . val as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMA_STARTUP_CLEAR ) ,
                "::" , stringify ! ( val ) ));
}
impl Clone for TPMA_STARTUP_CLEAR {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMA_MEMORY {
    pub __bindgen_anon_1: __BindgenUnionField<TPMA_MEMORY__bindgen_ty_1>,
    pub val: __BindgenUnionField<UINT32>,
    pub bindgen_union_field: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMA_MEMORY__bindgen_ty_1 {
    pub _bitfield_1: u32,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_TPMA_MEMORY__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<TPMA_MEMORY__bindgen_ty_1>() , 4usize ,
               concat ! (
               "Size of: " , stringify ! ( TPMA_MEMORY__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<TPMA_MEMORY__bindgen_ty_1>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPMA_MEMORY__bindgen_ty_1 )
                ));
}
impl Clone for TPMA_MEMORY__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl TPMA_MEMORY__bindgen_ty_1 {
    #[inline]
    pub fn sharedRAM(&self) -> ::std::os::raw::c_uint {
        let mask = 1usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_sharedRAM(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 1usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn sharedNV(&self) -> ::std::os::raw::c_uint {
        let mask = 2usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 1usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_sharedNV(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 2usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 1usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn objectCopiedToRam(&self) -> ::std::os::raw::c_uint {
        let mask = 4usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 2usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_objectCopiedToRam(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 4usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 2usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn reserved1(&self) -> ::std::os::raw::c_uint {
        let mask = 4294967288usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 3usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_reserved1(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 4294967288usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 3usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn new_bitfield_1(sharedRAM: ::std::os::raw::c_uint,
                          sharedNV: ::std::os::raw::c_uint,
                          objectCopiedToRam: ::std::os::raw::c_uint,
                          reserved1: ::std::os::raw::c_uint) -> u32 {
        ({
             ({
                  ({
                       ({ 0 } |
                            ((sharedRAM as u32 as u32) << 0usize) &
                                (1usize as u32))
                   } | ((sharedNV as u32 as u32) << 1usize) & (2usize as u32))
              } |
                  ((objectCopiedToRam as u32 as u32) << 2usize) &
                      (4usize as u32))
         } | ((reserved1 as u32 as u32) << 3usize) & (4294967288usize as u32))
    }
}
#[test]
fn bindgen_test_layout_TPMA_MEMORY() {
    assert_eq!(::std::mem::size_of::<TPMA_MEMORY>() , 4usize , concat ! (
               "Size of: " , stringify ! ( TPMA_MEMORY ) ));
    assert_eq! (::std::mem::align_of::<TPMA_MEMORY>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( TPMA_MEMORY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMA_MEMORY ) ) . val as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMA_MEMORY ) , "::" ,
                stringify ! ( val ) ));
}
impl Clone for TPMA_MEMORY {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMA_CC {
    pub __bindgen_anon_1: __BindgenUnionField<TPMA_CC__bindgen_ty_1>,
    pub val: __BindgenUnionField<UINT32>,
    pub bindgen_union_field: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMA_CC__bindgen_ty_1 {
    pub _bitfield_1: [u16; 2usize],
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_TPMA_CC__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<TPMA_CC__bindgen_ty_1>() , 4usize ,
               concat ! ( "Size of: " , stringify ! ( TPMA_CC__bindgen_ty_1 )
               ));
    assert_eq! (::std::mem::align_of::<TPMA_CC__bindgen_ty_1>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPMA_CC__bindgen_ty_1 ) ));
}
impl Clone for TPMA_CC__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl TPMA_CC__bindgen_ty_1 {
    #[inline]
    pub fn commandIndex(&self) -> ::std::os::raw::c_uint {
        let mask = 65535usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_commandIndex(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 65535usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn reserved1(&self) -> ::std::os::raw::c_uint {
        let mask = 4128768usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 16usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_reserved1(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 4128768usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 16usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn nv(&self) -> ::std::os::raw::c_uint {
        let mask = 4194304usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 22usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_nv(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 4194304usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 22usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn extensive(&self) -> ::std::os::raw::c_uint {
        let mask = 8388608usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 23usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_extensive(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 8388608usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 23usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn flushed(&self) -> ::std::os::raw::c_uint {
        let mask = 16777216usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 24usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_flushed(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 16777216usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 24usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn cHandles(&self) -> ::std::os::raw::c_uint {
        let mask = 234881024usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 25usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_cHandles(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 234881024usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 25usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn rHandle(&self) -> ::std::os::raw::c_uint {
        let mask = 268435456usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 28usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_rHandle(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 268435456usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 28usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn V(&self) -> ::std::os::raw::c_uint {
        let mask = 536870912usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 29usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_V(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 536870912usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 29usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn Res(&self) -> ::std::os::raw::c_uint {
        let mask = 3221225472usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 30usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_Res(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 3221225472usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 30usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn new_bitfield_1(commandIndex: ::std::os::raw::c_uint,
                          reserved1: ::std::os::raw::c_uint,
                          nv: ::std::os::raw::c_uint,
                          extensive: ::std::os::raw::c_uint,
                          flushed: ::std::os::raw::c_uint,
                          cHandles: ::std::os::raw::c_uint,
                          rHandle: ::std::os::raw::c_uint,
                          V: ::std::os::raw::c_uint,
                          Res: ::std::os::raw::c_uint) -> u32 {
        ({
             ({
                  ({
                       ({
                            ({
                                 ({
                                      ({
                                           ({
                                                ({ 0 } |
                                                     ((commandIndex as u32 as
                                                           u32) << 0usize) &
                                                         (65535usize as u32))
                                            } |
                                                ((reserved1 as u32 as u32) <<
                                                     16usize) &
                                                    (4128768usize as u32))
                                       } |
                                           ((nv as u32 as u32) << 22usize) &
                                               (4194304usize as u32))
                                  } |
                                      ((extensive as u32 as u32) << 23usize) &
                                          (8388608usize as u32))
                             } |
                                 ((flushed as u32 as u32) << 24usize) &
                                     (16777216usize as u32))
                        } |
                            ((cHandles as u32 as u32) << 25usize) &
                                (234881024usize as u32))
                   } |
                       ((rHandle as u32 as u32) << 28usize) &
                           (268435456usize as u32))
              } | ((V as u32 as u32) << 29usize) & (536870912usize as u32))
         } | ((Res as u32 as u32) << 30usize) & (3221225472usize as u32))
    }
}
#[test]
fn bindgen_test_layout_TPMA_CC() {
    assert_eq!(::std::mem::size_of::<TPMA_CC>() , 4usize , concat ! (
               "Size of: " , stringify ! ( TPMA_CC ) ));
    assert_eq! (::std::mem::align_of::<TPMA_CC>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( TPMA_CC ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMA_CC ) ) . val as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMA_CC ) , "::" ,
                stringify ! ( val ) ));
}
impl Clone for TPMA_CC {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMA_MODES {
    pub __bindgen_anon_1: __BindgenUnionField<TPMA_MODES__bindgen_ty_1>,
    pub val: __BindgenUnionField<UINT32>,
    pub bindgen_union_field: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMA_MODES__bindgen_ty_1 {
    pub _bitfield_1: u32,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_TPMA_MODES__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<TPMA_MODES__bindgen_ty_1>() , 4usize ,
               concat ! (
               "Size of: " , stringify ! ( TPMA_MODES__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<TPMA_MODES__bindgen_ty_1>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPMA_MODES__bindgen_ty_1 ) ));
}
impl Clone for TPMA_MODES__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl TPMA_MODES__bindgen_ty_1 {
    #[inline]
    pub fn FIPS_140_2(&self) -> ::std::os::raw::c_uint {
        let mask = 1usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_FIPS_140_2(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 1usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn reserved1(&self) -> ::std::os::raw::c_uint {
        let mask = 4294967294usize as u32;
        let unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 1usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_reserved1(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 4294967294usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::std::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 1usize) & mask;
        self._bitfield_1 = unsafe { ::std::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn new_bitfield_1(FIPS_140_2: ::std::os::raw::c_uint,
                          reserved1: ::std::os::raw::c_uint) -> u32 {
        ({
             ({ 0 } |
                  ((FIPS_140_2 as u32 as u32) << 0usize) & (1usize as u32))
         } | ((reserved1 as u32 as u32) << 1usize) & (4294967294usize as u32))
    }
}
#[test]
fn bindgen_test_layout_TPMA_MODES() {
    assert_eq!(::std::mem::size_of::<TPMA_MODES>() , 4usize , concat ! (
               "Size of: " , stringify ! ( TPMA_MODES ) ));
    assert_eq! (::std::mem::align_of::<TPMA_MODES>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( TPMA_MODES ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMA_MODES ) ) . val as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMA_MODES ) , "::" ,
                stringify ! ( val ) ));
}
impl Clone for TPMA_MODES {
    fn clone(&self) -> Self { *self }
}
pub type TPMI_YES_NO = BYTE;
pub type TPMI_DH_OBJECT = TPM_HANDLE;
pub type TPMI_DH_PERSISTENT = TPM_HANDLE;
pub type TPMI_DH_ENTITY = TPM_HANDLE;
pub type TPMI_DH_PCR = TPM_HANDLE;
pub type TPMI_SH_AUTH_SESSION = TPM_HANDLE;
pub type TPMI_SH_HMAC = TPM_HANDLE;
pub type TPMI_SH_POLICY = TPM_HANDLE;
pub type TPMI_DH_CONTEXT = TPM_HANDLE;
pub type TPMI_RH_HIERARCHY = TPM_HANDLE;
pub type TPMI_RH_ENABLES = TPM_HANDLE;
pub type TPMI_RH_HIERARCHY_AUTH = TPM_HANDLE;
pub type TPMI_RH_PLATFORM = TPM_HANDLE;
pub type TPMI_RH_OWNER = TPM_HANDLE;
pub type TPMI_RH_ENDORSEMENT = TPM_HANDLE;
pub type TPMI_RH_PROVISION = TPM_HANDLE;
pub type TPMI_RH_CLEAR = TPM_HANDLE;
pub type TPMI_RH_NV_AUTH = TPM_HANDLE;
pub type TPMI_RH_LOCKOUT = TPM_HANDLE;
pub type TPMI_RH_NV_INDEX = TPM_HANDLE;
pub type TPMI_ALG_HASH = TPM_ALG_ID;
pub type TPMI_ALG_ASYM = TPM_ALG_ID;
pub type TPMI_ALG_SYM = TPM_ALG_ID;
pub type TPMI_ALG_SYM_OBJECT = TPM_ALG_ID;
pub type TPMI_ALG_SYM_MODE = TPM_ALG_ID;
pub type TPMI_ALG_KDF = TPM_ALG_ID;
pub type TPMI_ALG_SIG_SCHEME = TPM_ALG_ID;
pub type TPMI_ECC_KEY_EXCHANGE = TPM_ALG_ID;
pub type TPMI_ST_COMMAND_TAG = TPM_ST;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMS_EMPTY {
    pub empty: __IncompleteArrayField<BYTE>,
}
#[test]
fn bindgen_test_layout_TPMS_EMPTY() {
    assert_eq!(::std::mem::size_of::<TPMS_EMPTY>() , 0usize , concat ! (
               "Size of: " , stringify ! ( TPMS_EMPTY ) ));
    assert_eq! (::std::mem::align_of::<TPMS_EMPTY>() , 1usize , concat ! (
                "Alignment of " , stringify ! ( TPMS_EMPTY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_EMPTY ) ) . empty as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_EMPTY ) , "::" ,
                stringify ! ( empty ) ));
}
impl Clone for TPMS_EMPTY {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMS_ALGORITHM_DESCRIPTION {
    pub alg: TPM_ALG_ID,
    pub attributes: TPMA_ALGORITHM,
}
#[test]
fn bindgen_test_layout_TPMS_ALGORITHM_DESCRIPTION() {
    assert_eq!(::std::mem::size_of::<TPMS_ALGORITHM_DESCRIPTION>() , 8usize ,
               concat ! (
               "Size of: " , stringify ! ( TPMS_ALGORITHM_DESCRIPTION ) ));
    assert_eq! (::std::mem::align_of::<TPMS_ALGORITHM_DESCRIPTION>() , 4usize
                , concat ! (
                "Alignment of " , stringify ! ( TPMS_ALGORITHM_DESCRIPTION )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_ALGORITHM_DESCRIPTION ) ) . alg as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPMS_ALGORITHM_DESCRIPTION ) , "::" , stringify ! ( alg ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_ALGORITHM_DESCRIPTION ) ) .
                attributes as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPMS_ALGORITHM_DESCRIPTION ) , "::" , stringify ! ( attributes
                ) ));
}
impl Clone for TPMS_ALGORITHM_DESCRIPTION {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPMU_HA {
    pub sha1: __BindgenUnionField<[BYTE; 20usize]>,
    pub sha256: __BindgenUnionField<[BYTE; 32usize]>,
    pub sha384: __BindgenUnionField<[BYTE; 48usize]>,
    pub sha512: __BindgenUnionField<[BYTE; 64usize]>,
    pub sm3_256: __BindgenUnionField<[BYTE; 32usize]>,
    pub bindgen_union_field: [u8; 64usize],
}
#[test]
fn bindgen_test_layout_TPMU_HA() {
    assert_eq!(::std::mem::size_of::<TPMU_HA>() , 64usize , concat ! (
               "Size of: " , stringify ! ( TPMU_HA ) ));
    assert_eq! (::std::mem::align_of::<TPMU_HA>() , 1usize , concat ! (
                "Alignment of " , stringify ! ( TPMU_HA ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_HA ) ) . sha1 as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_HA ) , "::" ,
                stringify ! ( sha1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_HA ) ) . sha256 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_HA ) , "::" ,
                stringify ! ( sha256 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_HA ) ) . sha384 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_HA ) , "::" ,
                stringify ! ( sha384 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_HA ) ) . sha512 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_HA ) , "::" ,
                stringify ! ( sha512 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_HA ) ) . sm3_256 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_HA ) , "::" ,
                stringify ! ( sm3_256 ) ));
}
impl Clone for TPMU_HA {
    fn clone(&self) -> Self { *self }
}
impl Default for TPMU_HA {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPMT_HA {
    pub hashAlg: TPMI_ALG_HASH,
    pub digest: TPMU_HA,
}
#[test]
fn bindgen_test_layout_TPMT_HA() {
    assert_eq!(::std::mem::size_of::<TPMT_HA>() , 66usize , concat ! (
               "Size of: " , stringify ! ( TPMT_HA ) ));
    assert_eq! (::std::mem::align_of::<TPMT_HA>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( TPMT_HA ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_HA ) ) . hashAlg as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_HA ) , "::" ,
                stringify ! ( hashAlg ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_HA ) ) . digest as * const _ as
                usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_HA ) , "::" ,
                stringify ! ( digest ) ));
}
impl Clone for TPMT_HA {
    fn clone(&self) -> Self { *self }
}
impl Default for TPMT_HA {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPM2B_DIGEST {
    pub t: __BindgenUnionField<TPM2B_DIGEST__bindgen_ty_1>,
    pub b: __BindgenUnionField<TPM2B>,
    pub bindgen_union_field: [u16; 33usize],
}
#[repr(C)]
pub struct TPM2B_DIGEST__bindgen_ty_1 {
    pub size: UINT16,
    pub buffer: [BYTE; 64usize],
}
#[test]
fn bindgen_test_layout_TPM2B_DIGEST__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<TPM2B_DIGEST__bindgen_ty_1>() , 66usize ,
               concat ! (
               "Size of: " , stringify ! ( TPM2B_DIGEST__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<TPM2B_DIGEST__bindgen_ty_1>() , 2usize
                , concat ! (
                "Alignment of " , stringify ! ( TPM2B_DIGEST__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_DIGEST__bindgen_ty_1 ) ) . size as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_DIGEST__bindgen_ty_1 ) , "::" , stringify ! ( size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_DIGEST__bindgen_ty_1 ) ) . buffer
                as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_DIGEST__bindgen_ty_1 ) , "::" , stringify ! ( buffer )
                ));
}
impl Default for TPM2B_DIGEST__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_TPM2B_DIGEST() {
    assert_eq!(::std::mem::size_of::<TPM2B_DIGEST>() , 66usize , concat ! (
               "Size of: " , stringify ! ( TPM2B_DIGEST ) ));
    assert_eq! (::std::mem::align_of::<TPM2B_DIGEST>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( TPM2B_DIGEST ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_DIGEST ) ) . t as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_DIGEST ) , "::" ,
                stringify ! ( t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_DIGEST ) ) . b as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_DIGEST ) , "::" ,
                stringify ! ( b ) ));
}
impl Clone for TPM2B_DIGEST {
    fn clone(&self) -> Self { *self }
}
impl Default for TPM2B_DIGEST {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPM2B_DATA {
    pub t: __BindgenUnionField<TPM2B_DATA__bindgen_ty_1>,
    pub b: __BindgenUnionField<TPM2B>,
    pub bindgen_union_field: [u16; 34usize],
}
#[repr(C)]
pub struct TPM2B_DATA__bindgen_ty_1 {
    pub size: UINT16,
    pub buffer: [BYTE; 66usize],
}
#[test]
fn bindgen_test_layout_TPM2B_DATA__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<TPM2B_DATA__bindgen_ty_1>() , 68usize ,
               concat ! (
               "Size of: " , stringify ! ( TPM2B_DATA__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<TPM2B_DATA__bindgen_ty_1>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPM2B_DATA__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_DATA__bindgen_ty_1 ) ) . size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_DATA__bindgen_ty_1 ) , "::" , stringify ! ( size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_DATA__bindgen_ty_1 ) ) . buffer as
                * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_DATA__bindgen_ty_1 ) , "::" , stringify ! ( buffer ) ));
}
impl Default for TPM2B_DATA__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_TPM2B_DATA() {
    assert_eq!(::std::mem::size_of::<TPM2B_DATA>() , 68usize , concat ! (
               "Size of: " , stringify ! ( TPM2B_DATA ) ));
    assert_eq! (::std::mem::align_of::<TPM2B_DATA>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( TPM2B_DATA ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_DATA ) ) . t as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_DATA ) , "::" ,
                stringify ! ( t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_DATA ) ) . b as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_DATA ) , "::" ,
                stringify ! ( b ) ));
}
impl Clone for TPM2B_DATA {
    fn clone(&self) -> Self { *self }
}
impl Default for TPM2B_DATA {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
pub type TPM2B_NONCE = TPM2B_DIGEST;
pub type TPM2B_AUTH = TPM2B_DIGEST;
pub type TPM2B_OPERAND = TPM2B_DIGEST;
#[repr(C)]
#[derive(Copy)]
pub struct TPM2B_EVENT {
    pub t: __BindgenUnionField<TPM2B_EVENT__bindgen_ty_1>,
    pub b: __BindgenUnionField<TPM2B>,
    pub bindgen_union_field: [u16; 513usize],
}
#[repr(C)]
pub struct TPM2B_EVENT__bindgen_ty_1 {
    pub size: UINT16,
    pub buffer: [BYTE; 1024usize],
}
#[test]
fn bindgen_test_layout_TPM2B_EVENT__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<TPM2B_EVENT__bindgen_ty_1>() , 1026usize
               , concat ! (
               "Size of: " , stringify ! ( TPM2B_EVENT__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<TPM2B_EVENT__bindgen_ty_1>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPM2B_EVENT__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_EVENT__bindgen_ty_1 ) ) . size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_EVENT__bindgen_ty_1 ) , "::" , stringify ! ( size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_EVENT__bindgen_ty_1 ) ) . buffer as
                * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_EVENT__bindgen_ty_1 ) , "::" , stringify ! ( buffer )
                ));
}
impl Default for TPM2B_EVENT__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_TPM2B_EVENT() {
    assert_eq!(::std::mem::size_of::<TPM2B_EVENT>() , 1026usize , concat ! (
               "Size of: " , stringify ! ( TPM2B_EVENT ) ));
    assert_eq! (::std::mem::align_of::<TPM2B_EVENT>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( TPM2B_EVENT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_EVENT ) ) . t as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_EVENT ) , "::" ,
                stringify ! ( t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_EVENT ) ) . b as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_EVENT ) , "::" ,
                stringify ! ( b ) ));
}
impl Clone for TPM2B_EVENT {
    fn clone(&self) -> Self { *self }
}
impl Default for TPM2B_EVENT {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPM2B_MAX_BUFFER {
    pub t: __BindgenUnionField<TPM2B_MAX_BUFFER__bindgen_ty_1>,
    pub b: __BindgenUnionField<TPM2B>,
    pub bindgen_union_field: [u16; 513usize],
}
#[repr(C)]
pub struct TPM2B_MAX_BUFFER__bindgen_ty_1 {
    pub size: UINT16,
    pub buffer: [BYTE; 1024usize],
}
#[test]
fn bindgen_test_layout_TPM2B_MAX_BUFFER__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<TPM2B_MAX_BUFFER__bindgen_ty_1>() ,
               1026usize , concat ! (
               "Size of: " , stringify ! ( TPM2B_MAX_BUFFER__bindgen_ty_1 )
               ));
    assert_eq! (::std::mem::align_of::<TPM2B_MAX_BUFFER__bindgen_ty_1>() ,
                2usize , concat ! (
                "Alignment of " , stringify ! ( TPM2B_MAX_BUFFER__bindgen_ty_1
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_MAX_BUFFER__bindgen_ty_1 ) ) . size
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_MAX_BUFFER__bindgen_ty_1 ) , "::" , stringify ! ( size )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_MAX_BUFFER__bindgen_ty_1 ) ) .
                buffer as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_MAX_BUFFER__bindgen_ty_1 ) , "::" , stringify ! ( buffer
                ) ));
}
impl Default for TPM2B_MAX_BUFFER__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_TPM2B_MAX_BUFFER() {
    assert_eq!(::std::mem::size_of::<TPM2B_MAX_BUFFER>() , 1026usize , concat
               ! ( "Size of: " , stringify ! ( TPM2B_MAX_BUFFER ) ));
    assert_eq! (::std::mem::align_of::<TPM2B_MAX_BUFFER>() , 2usize , concat !
                ( "Alignment of " , stringify ! ( TPM2B_MAX_BUFFER ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_MAX_BUFFER ) ) . t as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_MAX_BUFFER ) ,
                "::" , stringify ! ( t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_MAX_BUFFER ) ) . b as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_MAX_BUFFER ) ,
                "::" , stringify ! ( b ) ));
}
impl Clone for TPM2B_MAX_BUFFER {
    fn clone(&self) -> Self { *self }
}
impl Default for TPM2B_MAX_BUFFER {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPM2B_MAX_NV_BUFFER {
    pub t: __BindgenUnionField<TPM2B_MAX_NV_BUFFER__bindgen_ty_1>,
    pub b: __BindgenUnionField<TPM2B>,
    pub bindgen_union_field: [u16; 513usize],
}
#[repr(C)]
pub struct TPM2B_MAX_NV_BUFFER__bindgen_ty_1 {
    pub size: UINT16,
    pub buffer: [BYTE; 1024usize],
}
#[test]
fn bindgen_test_layout_TPM2B_MAX_NV_BUFFER__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<TPM2B_MAX_NV_BUFFER__bindgen_ty_1>() ,
               1026usize , concat ! (
               "Size of: " , stringify ! ( TPM2B_MAX_NV_BUFFER__bindgen_ty_1 )
               ));
    assert_eq! (::std::mem::align_of::<TPM2B_MAX_NV_BUFFER__bindgen_ty_1>() ,
                2usize , concat ! (
                "Alignment of " , stringify ! (
                TPM2B_MAX_NV_BUFFER__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_MAX_NV_BUFFER__bindgen_ty_1 ) ) .
                size as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_MAX_NV_BUFFER__bindgen_ty_1 ) , "::" , stringify ! (
                size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_MAX_NV_BUFFER__bindgen_ty_1 ) ) .
                buffer as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_MAX_NV_BUFFER__bindgen_ty_1 ) , "::" , stringify ! (
                buffer ) ));
}
impl Default for TPM2B_MAX_NV_BUFFER__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_TPM2B_MAX_NV_BUFFER() {
    assert_eq!(::std::mem::size_of::<TPM2B_MAX_NV_BUFFER>() , 1026usize ,
               concat ! ( "Size of: " , stringify ! ( TPM2B_MAX_NV_BUFFER )
               ));
    assert_eq! (::std::mem::align_of::<TPM2B_MAX_NV_BUFFER>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPM2B_MAX_NV_BUFFER ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_MAX_NV_BUFFER ) ) . t as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_MAX_NV_BUFFER ) ,
                "::" , stringify ! ( t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_MAX_NV_BUFFER ) ) . b as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_MAX_NV_BUFFER ) ,
                "::" , stringify ! ( b ) ));
}
impl Clone for TPM2B_MAX_NV_BUFFER {
    fn clone(&self) -> Self { *self }
}
impl Default for TPM2B_MAX_NV_BUFFER {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
pub type TPM2B_TIMEOUT = TPM2B_DIGEST;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPM2B_IV {
    pub t: __BindgenUnionField<TPM2B_IV__bindgen_ty_1>,
    pub b: __BindgenUnionField<TPM2B>,
    pub bindgen_union_field: [u16; 9usize],
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPM2B_IV__bindgen_ty_1 {
    pub size: UINT16,
    pub buffer: [BYTE; 16usize],
}
#[test]
fn bindgen_test_layout_TPM2B_IV__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<TPM2B_IV__bindgen_ty_1>() , 18usize ,
               concat ! ( "Size of: " , stringify ! ( TPM2B_IV__bindgen_ty_1 )
               ));
    assert_eq! (::std::mem::align_of::<TPM2B_IV__bindgen_ty_1>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPM2B_IV__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_IV__bindgen_ty_1 ) ) . size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_IV__bindgen_ty_1
                ) , "::" , stringify ! ( size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_IV__bindgen_ty_1 ) ) . buffer as *
                const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_IV__bindgen_ty_1
                ) , "::" , stringify ! ( buffer ) ));
}
impl Clone for TPM2B_IV__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_TPM2B_IV() {
    assert_eq!(::std::mem::size_of::<TPM2B_IV>() , 18usize , concat ! (
               "Size of: " , stringify ! ( TPM2B_IV ) ));
    assert_eq! (::std::mem::align_of::<TPM2B_IV>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( TPM2B_IV ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_IV ) ) . t as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_IV ) , "::" ,
                stringify ! ( t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_IV ) ) . b as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_IV ) , "::" ,
                stringify ! ( b ) ));
}
impl Clone for TPM2B_IV {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMU_NAME {
    pub digest: __BindgenUnionField<TPMT_HA>,
    pub handle: __BindgenUnionField<TPM_HANDLE>,
    pub bindgen_union_field: [u32; 17usize],
}
#[test]
fn bindgen_test_layout_TPMU_NAME() {
    assert_eq!(::std::mem::size_of::<TPMU_NAME>() , 68usize , concat ! (
               "Size of: " , stringify ! ( TPMU_NAME ) ));
    assert_eq! (::std::mem::align_of::<TPMU_NAME>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( TPMU_NAME ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_NAME ) ) . digest as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_NAME ) , "::" ,
                stringify ! ( digest ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_NAME ) ) . handle as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_NAME ) , "::" ,
                stringify ! ( handle ) ));
}
impl Clone for TPMU_NAME {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPM2B_NAME {
    pub t: __BindgenUnionField<TPM2B_NAME__bindgen_ty_1>,
    pub b: __BindgenUnionField<TPM2B>,
    pub bindgen_union_field: [u16; 35usize],
}
#[repr(C)]
pub struct TPM2B_NAME__bindgen_ty_1 {
    pub size: UINT16,
    pub name: [BYTE; 68usize],
}
#[test]
fn bindgen_test_layout_TPM2B_NAME__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<TPM2B_NAME__bindgen_ty_1>() , 70usize ,
               concat ! (
               "Size of: " , stringify ! ( TPM2B_NAME__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<TPM2B_NAME__bindgen_ty_1>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPM2B_NAME__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_NAME__bindgen_ty_1 ) ) . size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_NAME__bindgen_ty_1 ) , "::" , stringify ! ( size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_NAME__bindgen_ty_1 ) ) . name as *
                const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_NAME__bindgen_ty_1 ) , "::" , stringify ! ( name ) ));
}
impl Default for TPM2B_NAME__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_TPM2B_NAME() {
    assert_eq!(::std::mem::size_of::<TPM2B_NAME>() , 70usize , concat ! (
               "Size of: " , stringify ! ( TPM2B_NAME ) ));
    assert_eq! (::std::mem::align_of::<TPM2B_NAME>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( TPM2B_NAME ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_NAME ) ) . t as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_NAME ) , "::" ,
                stringify ! ( t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_NAME ) ) . b as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_NAME ) , "::" ,
                stringify ! ( b ) ));
}
impl Clone for TPM2B_NAME {
    fn clone(&self) -> Self { *self }
}
impl Default for TPM2B_NAME {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMS_PCR_SELECT {
    pub sizeofSelect: UINT8,
    pub pcrSelect: [BYTE; 3usize],
}
#[test]
fn bindgen_test_layout_TPMS_PCR_SELECT() {
    assert_eq!(::std::mem::size_of::<TPMS_PCR_SELECT>() , 4usize , concat ! (
               "Size of: " , stringify ! ( TPMS_PCR_SELECT ) ));
    assert_eq! (::std::mem::align_of::<TPMS_PCR_SELECT>() , 1usize , concat !
                ( "Alignment of " , stringify ! ( TPMS_PCR_SELECT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_PCR_SELECT ) ) . sizeofSelect as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_PCR_SELECT ) ,
                "::" , stringify ! ( sizeofSelect ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_PCR_SELECT ) ) . pcrSelect as *
                const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_PCR_SELECT ) ,
                "::" , stringify ! ( pcrSelect ) ));
}
impl Clone for TPMS_PCR_SELECT {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMS_PCR_SELECTION {
    pub hash: TPMI_ALG_HASH,
    pub sizeofSelect: UINT8,
    pub pcrSelect: [BYTE; 3usize],
}
#[test]
fn bindgen_test_layout_TPMS_PCR_SELECTION() {
    assert_eq!(::std::mem::size_of::<TPMS_PCR_SELECTION>() , 6usize , concat !
               ( "Size of: " , stringify ! ( TPMS_PCR_SELECTION ) ));
    assert_eq! (::std::mem::align_of::<TPMS_PCR_SELECTION>() , 2usize , concat
                ! ( "Alignment of " , stringify ! ( TPMS_PCR_SELECTION ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_PCR_SELECTION ) ) . hash as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_PCR_SELECTION ) ,
                "::" , stringify ! ( hash ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_PCR_SELECTION ) ) . sizeofSelect as
                * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_PCR_SELECTION ) ,
                "::" , stringify ! ( sizeofSelect ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_PCR_SELECTION ) ) . pcrSelect as *
                const _ as usize } , 3usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_PCR_SELECTION ) ,
                "::" , stringify ! ( pcrSelect ) ));
}
impl Clone for TPMS_PCR_SELECTION {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPMT_TK_CREATION {
    pub tag: TPM_ST,
    pub hierarchy: TPMI_RH_HIERARCHY,
    pub digest: TPM2B_DIGEST,
}
#[test]
fn bindgen_test_layout_TPMT_TK_CREATION() {
    assert_eq!(::std::mem::size_of::<TPMT_TK_CREATION>() , 76usize , concat !
               ( "Size of: " , stringify ! ( TPMT_TK_CREATION ) ));
    assert_eq! (::std::mem::align_of::<TPMT_TK_CREATION>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( TPMT_TK_CREATION ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_TK_CREATION ) ) . tag as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_TK_CREATION ) ,
                "::" , stringify ! ( tag ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_TK_CREATION ) ) . hierarchy as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_TK_CREATION ) ,
                "::" , stringify ! ( hierarchy ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_TK_CREATION ) ) . digest as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_TK_CREATION ) ,
                "::" , stringify ! ( digest ) ));
}
impl Clone for TPMT_TK_CREATION {
    fn clone(&self) -> Self { *self }
}
impl Default for TPMT_TK_CREATION {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPMT_TK_VERIFIED {
    pub tag: TPM_ST,
    pub hierarchy: TPMI_RH_HIERARCHY,
    pub digest: TPM2B_DIGEST,
}
#[test]
fn bindgen_test_layout_TPMT_TK_VERIFIED() {
    assert_eq!(::std::mem::size_of::<TPMT_TK_VERIFIED>() , 76usize , concat !
               ( "Size of: " , stringify ! ( TPMT_TK_VERIFIED ) ));
    assert_eq! (::std::mem::align_of::<TPMT_TK_VERIFIED>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( TPMT_TK_VERIFIED ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_TK_VERIFIED ) ) . tag as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_TK_VERIFIED ) ,
                "::" , stringify ! ( tag ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_TK_VERIFIED ) ) . hierarchy as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_TK_VERIFIED ) ,
                "::" , stringify ! ( hierarchy ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_TK_VERIFIED ) ) . digest as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_TK_VERIFIED ) ,
                "::" , stringify ! ( digest ) ));
}
impl Clone for TPMT_TK_VERIFIED {
    fn clone(&self) -> Self { *self }
}
impl Default for TPMT_TK_VERIFIED {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPMT_TK_AUTH {
    pub tag: TPM_ST,
    pub hierarchy: TPMI_RH_HIERARCHY,
    pub digest: TPM2B_DIGEST,
}
#[test]
fn bindgen_test_layout_TPMT_TK_AUTH() {
    assert_eq!(::std::mem::size_of::<TPMT_TK_AUTH>() , 76usize , concat ! (
               "Size of: " , stringify ! ( TPMT_TK_AUTH ) ));
    assert_eq! (::std::mem::align_of::<TPMT_TK_AUTH>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( TPMT_TK_AUTH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_TK_AUTH ) ) . tag as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_TK_AUTH ) , "::" ,
                stringify ! ( tag ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_TK_AUTH ) ) . hierarchy as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_TK_AUTH ) , "::" ,
                stringify ! ( hierarchy ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_TK_AUTH ) ) . digest as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_TK_AUTH ) , "::" ,
                stringify ! ( digest ) ));
}
impl Clone for TPMT_TK_AUTH {
    fn clone(&self) -> Self { *self }
}
impl Default for TPMT_TK_AUTH {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPMT_TK_HASHCHECK {
    pub tag: TPM_ST,
    pub hierarchy: TPMI_RH_HIERARCHY,
    pub digest: TPM2B_DIGEST,
}
#[test]
fn bindgen_test_layout_TPMT_TK_HASHCHECK() {
    assert_eq!(::std::mem::size_of::<TPMT_TK_HASHCHECK>() , 76usize , concat !
               ( "Size of: " , stringify ! ( TPMT_TK_HASHCHECK ) ));
    assert_eq! (::std::mem::align_of::<TPMT_TK_HASHCHECK>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( TPMT_TK_HASHCHECK ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_TK_HASHCHECK ) ) . tag as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_TK_HASHCHECK ) ,
                "::" , stringify ! ( tag ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_TK_HASHCHECK ) ) . hierarchy as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_TK_HASHCHECK ) ,
                "::" , stringify ! ( hierarchy ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_TK_HASHCHECK ) ) . digest as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_TK_HASHCHECK ) ,
                "::" , stringify ! ( digest ) ));
}
impl Clone for TPMT_TK_HASHCHECK {
    fn clone(&self) -> Self { *self }
}
impl Default for TPMT_TK_HASHCHECK {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMS_ALG_PROPERTY {
    pub alg: TPM_ALG_ID,
    pub algProperties: TPMA_ALGORITHM,
}
#[test]
fn bindgen_test_layout_TPMS_ALG_PROPERTY() {
    assert_eq!(::std::mem::size_of::<TPMS_ALG_PROPERTY>() , 8usize , concat !
               ( "Size of: " , stringify ! ( TPMS_ALG_PROPERTY ) ));
    assert_eq! (::std::mem::align_of::<TPMS_ALG_PROPERTY>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( TPMS_ALG_PROPERTY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_ALG_PROPERTY ) ) . alg as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_ALG_PROPERTY ) ,
                "::" , stringify ! ( alg ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_ALG_PROPERTY ) ) . algProperties as
                * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_ALG_PROPERTY ) ,
                "::" , stringify ! ( algProperties ) ));
}
impl Clone for TPMS_ALG_PROPERTY {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMS_TAGGED_PROPERTY {
    pub property: TPM_PT,
    pub value: UINT32,
}
#[test]
fn bindgen_test_layout_TPMS_TAGGED_PROPERTY() {
    assert_eq!(::std::mem::size_of::<TPMS_TAGGED_PROPERTY>() , 8usize , concat
               ! ( "Size of: " , stringify ! ( TPMS_TAGGED_PROPERTY ) ));
    assert_eq! (::std::mem::align_of::<TPMS_TAGGED_PROPERTY>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPMS_TAGGED_PROPERTY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_TAGGED_PROPERTY ) ) . property as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_TAGGED_PROPERTY )
                , "::" , stringify ! ( property ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_TAGGED_PROPERTY ) ) . value as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_TAGGED_PROPERTY )
                , "::" , stringify ! ( value ) ));
}
impl Clone for TPMS_TAGGED_PROPERTY {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMS_TAGGED_PCR_SELECT {
    pub tag: TPM_PT_PCR,
    pub sizeofSelect: UINT8,
    pub pcrSelect: [BYTE; 3usize],
}
#[test]
fn bindgen_test_layout_TPMS_TAGGED_PCR_SELECT() {
    assert_eq!(::std::mem::size_of::<TPMS_TAGGED_PCR_SELECT>() , 8usize ,
               concat ! ( "Size of: " , stringify ! ( TPMS_TAGGED_PCR_SELECT )
               ));
    assert_eq! (::std::mem::align_of::<TPMS_TAGGED_PCR_SELECT>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPMS_TAGGED_PCR_SELECT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_TAGGED_PCR_SELECT ) ) . tag as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_TAGGED_PCR_SELECT
                ) , "::" , stringify ! ( tag ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_TAGGED_PCR_SELECT ) ) . sizeofSelect
                as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_TAGGED_PCR_SELECT
                ) , "::" , stringify ! ( sizeofSelect ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_TAGGED_PCR_SELECT ) ) . pcrSelect as
                * const _ as usize } , 5usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_TAGGED_PCR_SELECT
                ) , "::" , stringify ! ( pcrSelect ) ));
}
impl Clone for TPMS_TAGGED_PCR_SELECT {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
pub struct TPML_CC {
    pub count: UINT32,
    pub commandCodes: [TPM_CC; 114usize],
}
#[test]
fn bindgen_test_layout_TPML_CC() {
    assert_eq!(::std::mem::size_of::<TPML_CC>() , 460usize , concat ! (
               "Size of: " , stringify ! ( TPML_CC ) ));
    assert_eq! (::std::mem::align_of::<TPML_CC>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( TPML_CC ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPML_CC ) ) . count as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPML_CC ) , "::" ,
                stringify ! ( count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPML_CC ) ) . commandCodes as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( TPML_CC ) , "::" ,
                stringify ! ( commandCodes ) ));
}
impl Default for TPML_CC {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
pub struct TPML_CCA {
    pub count: UINT32,
    pub commandAttributes: [TPMA_CC; 114usize],
}
#[test]
fn bindgen_test_layout_TPML_CCA() {
    assert_eq!(::std::mem::size_of::<TPML_CCA>() , 460usize , concat ! (
               "Size of: " , stringify ! ( TPML_CCA ) ));
    assert_eq! (::std::mem::align_of::<TPML_CCA>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( TPML_CCA ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPML_CCA ) ) . count as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPML_CCA ) , "::" ,
                stringify ! ( count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPML_CCA ) ) . commandAttributes as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( TPML_CCA ) , "::" ,
                stringify ! ( commandAttributes ) ));
}
impl Default for TPML_CCA {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
pub struct TPML_ALG {
    pub count: UINT32,
    pub algorithms: [TPM_ALG_ID; 64usize],
}
#[test]
fn bindgen_test_layout_TPML_ALG() {
    assert_eq!(::std::mem::size_of::<TPML_ALG>() , 132usize , concat ! (
               "Size of: " , stringify ! ( TPML_ALG ) ));
    assert_eq! (::std::mem::align_of::<TPML_ALG>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( TPML_ALG ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPML_ALG ) ) . count as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPML_ALG ) , "::" ,
                stringify ! ( count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPML_ALG ) ) . algorithms as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( TPML_ALG ) , "::" ,
                stringify ! ( algorithms ) ));
}
impl Default for TPML_ALG {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
pub struct TPML_HANDLE {
    pub count: UINT32,
    pub handle: [TPM_HANDLE; 254usize],
}
#[test]
fn bindgen_test_layout_TPML_HANDLE() {
    assert_eq!(::std::mem::size_of::<TPML_HANDLE>() , 1020usize , concat ! (
               "Size of: " , stringify ! ( TPML_HANDLE ) ));
    assert_eq! (::std::mem::align_of::<TPML_HANDLE>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( TPML_HANDLE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPML_HANDLE ) ) . count as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPML_HANDLE ) , "::" ,
                stringify ! ( count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPML_HANDLE ) ) . handle as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( TPML_HANDLE ) , "::" ,
                stringify ! ( handle ) ));
}
impl Default for TPML_HANDLE {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPML_DIGEST {
    pub count: UINT32,
    pub digests: [TPM2B_DIGEST; 8usize],
}
#[test]
fn bindgen_test_layout_TPML_DIGEST() {
    assert_eq!(::std::mem::size_of::<TPML_DIGEST>() , 532usize , concat ! (
               "Size of: " , stringify ! ( TPML_DIGEST ) ));
    assert_eq! (::std::mem::align_of::<TPML_DIGEST>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( TPML_DIGEST ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPML_DIGEST ) ) . count as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPML_DIGEST ) , "::" ,
                stringify ! ( count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPML_DIGEST ) ) . digests as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( TPML_DIGEST ) , "::" ,
                stringify ! ( digests ) ));
}
impl Clone for TPML_DIGEST {
    fn clone(&self) -> Self { *self }
}
impl Default for TPML_DIGEST {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPML_DIGEST_VALUES {
    pub count: UINT32,
    pub digests: [TPMT_HA; 5usize],
}
#[test]
fn bindgen_test_layout_TPML_DIGEST_VALUES() {
    assert_eq!(::std::mem::size_of::<TPML_DIGEST_VALUES>() , 336usize , concat
               ! ( "Size of: " , stringify ! ( TPML_DIGEST_VALUES ) ));
    assert_eq! (::std::mem::align_of::<TPML_DIGEST_VALUES>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( TPML_DIGEST_VALUES ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPML_DIGEST_VALUES ) ) . count as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPML_DIGEST_VALUES ) ,
                "::" , stringify ! ( count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPML_DIGEST_VALUES ) ) . digests as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( TPML_DIGEST_VALUES ) ,
                "::" , stringify ! ( digests ) ));
}
impl Clone for TPML_DIGEST_VALUES {
    fn clone(&self) -> Self { *self }
}
impl Default for TPML_DIGEST_VALUES {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPM2B_DIGEST_VALUES {
    pub t: __BindgenUnionField<TPM2B_DIGEST_VALUES__bindgen_ty_1>,
    pub b: __BindgenUnionField<TPM2B>,
    pub bindgen_union_field: [u16; 169usize],
}
#[repr(C)]
pub struct TPM2B_DIGEST_VALUES__bindgen_ty_1 {
    pub size: UINT16,
    pub buffer: [BYTE; 336usize],
}
#[test]
fn bindgen_test_layout_TPM2B_DIGEST_VALUES__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<TPM2B_DIGEST_VALUES__bindgen_ty_1>() ,
               338usize , concat ! (
               "Size of: " , stringify ! ( TPM2B_DIGEST_VALUES__bindgen_ty_1 )
               ));
    assert_eq! (::std::mem::align_of::<TPM2B_DIGEST_VALUES__bindgen_ty_1>() ,
                2usize , concat ! (
                "Alignment of " , stringify ! (
                TPM2B_DIGEST_VALUES__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_DIGEST_VALUES__bindgen_ty_1 ) ) .
                size as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_DIGEST_VALUES__bindgen_ty_1 ) , "::" , stringify ! (
                size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_DIGEST_VALUES__bindgen_ty_1 ) ) .
                buffer as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_DIGEST_VALUES__bindgen_ty_1 ) , "::" , stringify ! (
                buffer ) ));
}
impl Default for TPM2B_DIGEST_VALUES__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_TPM2B_DIGEST_VALUES() {
    assert_eq!(::std::mem::size_of::<TPM2B_DIGEST_VALUES>() , 338usize ,
               concat ! ( "Size of: " , stringify ! ( TPM2B_DIGEST_VALUES )
               ));
    assert_eq! (::std::mem::align_of::<TPM2B_DIGEST_VALUES>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPM2B_DIGEST_VALUES ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_DIGEST_VALUES ) ) . t as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_DIGEST_VALUES ) ,
                "::" , stringify ! ( t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_DIGEST_VALUES ) ) . b as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_DIGEST_VALUES ) ,
                "::" , stringify ! ( b ) ));
}
impl Clone for TPM2B_DIGEST_VALUES {
    fn clone(&self) -> Self { *self }
}
impl Default for TPM2B_DIGEST_VALUES {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPML_PCR_SELECTION {
    pub count: UINT32,
    pub pcrSelections: [TPMS_PCR_SELECTION; 5usize],
}
#[test]
fn bindgen_test_layout_TPML_PCR_SELECTION() {
    assert_eq!(::std::mem::size_of::<TPML_PCR_SELECTION>() , 36usize , concat
               ! ( "Size of: " , stringify ! ( TPML_PCR_SELECTION ) ));
    assert_eq! (::std::mem::align_of::<TPML_PCR_SELECTION>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( TPML_PCR_SELECTION ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPML_PCR_SELECTION ) ) . count as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPML_PCR_SELECTION ) ,
                "::" , stringify ! ( count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPML_PCR_SELECTION ) ) . pcrSelections as
                * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( TPML_PCR_SELECTION ) ,
                "::" , stringify ! ( pcrSelections ) ));
}
impl Clone for TPML_PCR_SELECTION {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
pub struct TPML_ALG_PROPERTY {
    pub count: UINT32,
    pub algProperties: [TPMS_ALG_PROPERTY; 68usize],
}
#[test]
fn bindgen_test_layout_TPML_ALG_PROPERTY() {
    assert_eq!(::std::mem::size_of::<TPML_ALG_PROPERTY>() , 548usize , concat
               ! ( "Size of: " , stringify ! ( TPML_ALG_PROPERTY ) ));
    assert_eq! (::std::mem::align_of::<TPML_ALG_PROPERTY>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( TPML_ALG_PROPERTY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPML_ALG_PROPERTY ) ) . count as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPML_ALG_PROPERTY ) ,
                "::" , stringify ! ( count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPML_ALG_PROPERTY ) ) . algProperties as
                * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( TPML_ALG_PROPERTY ) ,
                "::" , stringify ! ( algProperties ) ));
}
impl Default for TPML_ALG_PROPERTY {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
pub struct TPML_TAGGED_TPM_PROPERTY {
    pub count: UINT32,
    pub tpmProperty: [TPMS_TAGGED_PROPERTY; 127usize],
}
#[test]
fn bindgen_test_layout_TPML_TAGGED_TPM_PROPERTY() {
    assert_eq!(::std::mem::size_of::<TPML_TAGGED_TPM_PROPERTY>() , 1020usize ,
               concat ! (
               "Size of: " , stringify ! ( TPML_TAGGED_TPM_PROPERTY ) ));
    assert_eq! (::std::mem::align_of::<TPML_TAGGED_TPM_PROPERTY>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPML_TAGGED_TPM_PROPERTY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPML_TAGGED_TPM_PROPERTY ) ) . count as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPML_TAGGED_TPM_PROPERTY ) , "::" , stringify ! ( count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPML_TAGGED_TPM_PROPERTY ) ) .
                tpmProperty as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPML_TAGGED_TPM_PROPERTY ) , "::" , stringify ! ( tpmProperty
                ) ));
}
impl Default for TPML_TAGGED_TPM_PROPERTY {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
pub struct TPML_TAGGED_PCR_PROPERTY {
    pub count: UINT32,
    pub pcrProperty: [TPMS_TAGGED_PCR_SELECT; 127usize],
}
#[test]
fn bindgen_test_layout_TPML_TAGGED_PCR_PROPERTY() {
    assert_eq!(::std::mem::size_of::<TPML_TAGGED_PCR_PROPERTY>() , 1020usize ,
               concat ! (
               "Size of: " , stringify ! ( TPML_TAGGED_PCR_PROPERTY ) ));
    assert_eq! (::std::mem::align_of::<TPML_TAGGED_PCR_PROPERTY>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPML_TAGGED_PCR_PROPERTY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPML_TAGGED_PCR_PROPERTY ) ) . count as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPML_TAGGED_PCR_PROPERTY ) , "::" , stringify ! ( count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPML_TAGGED_PCR_PROPERTY ) ) .
                pcrProperty as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPML_TAGGED_PCR_PROPERTY ) , "::" , stringify ! ( pcrProperty
                ) ));
}
impl Default for TPML_TAGGED_PCR_PROPERTY {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
pub struct TPML_ECC_CURVE {
    pub count: UINT32,
    pub eccCurves: [TPM_ECC_CURVE; 508usize],
}
#[test]
fn bindgen_test_layout_TPML_ECC_CURVE() {
    assert_eq!(::std::mem::size_of::<TPML_ECC_CURVE>() , 1020usize , concat !
               ( "Size of: " , stringify ! ( TPML_ECC_CURVE ) ));
    assert_eq! (::std::mem::align_of::<TPML_ECC_CURVE>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( TPML_ECC_CURVE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPML_ECC_CURVE ) ) . count as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPML_ECC_CURVE ) , "::"
                , stringify ! ( count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPML_ECC_CURVE ) ) . eccCurves as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( TPML_ECC_CURVE ) , "::"
                , stringify ! ( eccCurves ) ));
}
impl Default for TPML_ECC_CURVE {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
pub struct TPML_INTEL_PTT_PROPERTY {
    pub count: UINT32,
    pub property: [UINT32; 254usize],
}
#[test]
fn bindgen_test_layout_TPML_INTEL_PTT_PROPERTY() {
    assert_eq!(::std::mem::size_of::<TPML_INTEL_PTT_PROPERTY>() , 1020usize ,
               concat ! (
               "Size of: " , stringify ! ( TPML_INTEL_PTT_PROPERTY ) ));
    assert_eq! (::std::mem::align_of::<TPML_INTEL_PTT_PROPERTY>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPML_INTEL_PTT_PROPERTY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPML_INTEL_PTT_PROPERTY ) ) . count as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPML_INTEL_PTT_PROPERTY
                ) , "::" , stringify ! ( count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPML_INTEL_PTT_PROPERTY ) ) . property as
                * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( TPML_INTEL_PTT_PROPERTY
                ) , "::" , stringify ! ( property ) ));
}
impl Default for TPML_INTEL_PTT_PROPERTY {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPMU_CAPABILITIES {
    pub algorithms: __BindgenUnionField<TPML_ALG_PROPERTY>,
    pub handles: __BindgenUnionField<TPML_HANDLE>,
    pub command: __BindgenUnionField<TPML_CCA>,
    pub ppCommands: __BindgenUnionField<TPML_CC>,
    pub auditCommands: __BindgenUnionField<TPML_CC>,
    pub assignedPCR: __BindgenUnionField<TPML_PCR_SELECTION>,
    pub tpmProperties: __BindgenUnionField<TPML_TAGGED_TPM_PROPERTY>,
    pub pcrProperties: __BindgenUnionField<TPML_TAGGED_PCR_PROPERTY>,
    pub eccCurves: __BindgenUnionField<TPML_ECC_CURVE>,
    pub intelPttProperty: __BindgenUnionField<TPML_INTEL_PTT_PROPERTY>,
    pub bindgen_union_field: [u32; 255usize],
}
#[test]
fn bindgen_test_layout_TPMU_CAPABILITIES() {
    assert_eq!(::std::mem::size_of::<TPMU_CAPABILITIES>() , 1020usize , concat
               ! ( "Size of: " , stringify ! ( TPMU_CAPABILITIES ) ));
    assert_eq! (::std::mem::align_of::<TPMU_CAPABILITIES>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( TPMU_CAPABILITIES ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_CAPABILITIES ) ) . algorithms as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_CAPABILITIES ) ,
                "::" , stringify ! ( algorithms ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_CAPABILITIES ) ) . handles as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_CAPABILITIES ) ,
                "::" , stringify ! ( handles ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_CAPABILITIES ) ) . command as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_CAPABILITIES ) ,
                "::" , stringify ! ( command ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_CAPABILITIES ) ) . ppCommands as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_CAPABILITIES ) ,
                "::" , stringify ! ( ppCommands ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_CAPABILITIES ) ) . auditCommands as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_CAPABILITIES ) ,
                "::" , stringify ! ( auditCommands ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_CAPABILITIES ) ) . assignedPCR as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_CAPABILITIES ) ,
                "::" , stringify ! ( assignedPCR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_CAPABILITIES ) ) . tpmProperties as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_CAPABILITIES ) ,
                "::" , stringify ! ( tpmProperties ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_CAPABILITIES ) ) . pcrProperties as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_CAPABILITIES ) ,
                "::" , stringify ! ( pcrProperties ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_CAPABILITIES ) ) . eccCurves as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_CAPABILITIES ) ,
                "::" , stringify ! ( eccCurves ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_CAPABILITIES ) ) . intelPttProperty
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_CAPABILITIES ) ,
                "::" , stringify ! ( intelPttProperty ) ));
}
impl Clone for TPMU_CAPABILITIES {
    fn clone(&self) -> Self { *self }
}
impl Default for TPMU_CAPABILITIES {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPMS_CAPABILITY_DATA {
    pub capability: TPM_CAP,
    pub data: TPMU_CAPABILITIES,
}
#[test]
fn bindgen_test_layout_TPMS_CAPABILITY_DATA() {
    assert_eq!(::std::mem::size_of::<TPMS_CAPABILITY_DATA>() , 1024usize ,
               concat ! ( "Size of: " , stringify ! ( TPMS_CAPABILITY_DATA )
               ));
    assert_eq! (::std::mem::align_of::<TPMS_CAPABILITY_DATA>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPMS_CAPABILITY_DATA ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_CAPABILITY_DATA ) ) . capability as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_CAPABILITY_DATA )
                , "::" , stringify ! ( capability ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_CAPABILITY_DATA ) ) . data as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_CAPABILITY_DATA )
                , "::" , stringify ! ( data ) ));
}
impl Clone for TPMS_CAPABILITY_DATA {
    fn clone(&self) -> Self { *self }
}
impl Default for TPMS_CAPABILITY_DATA {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMS_CLOCK_INFO {
    pub clock: UINT64,
    pub resetCount: UINT32,
    pub restartCount: UINT32,
    pub safe: TPMI_YES_NO,
}
#[test]
fn bindgen_test_layout_TPMS_CLOCK_INFO() {
    assert_eq!(::std::mem::size_of::<TPMS_CLOCK_INFO>() , 24usize , concat ! (
               "Size of: " , stringify ! ( TPMS_CLOCK_INFO ) ));
    assert_eq! (::std::mem::align_of::<TPMS_CLOCK_INFO>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( TPMS_CLOCK_INFO ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_CLOCK_INFO ) ) . clock as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_CLOCK_INFO ) ,
                "::" , stringify ! ( clock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_CLOCK_INFO ) ) . resetCount as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_CLOCK_INFO ) ,
                "::" , stringify ! ( resetCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_CLOCK_INFO ) ) . restartCount as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_CLOCK_INFO ) ,
                "::" , stringify ! ( restartCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_CLOCK_INFO ) ) . safe as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_CLOCK_INFO ) ,
                "::" , stringify ! ( safe ) ));
}
impl Clone for TPMS_CLOCK_INFO {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMS_TIME_INFO {
    pub time: UINT64,
    pub clockInfo: TPMS_CLOCK_INFO,
}
#[test]
fn bindgen_test_layout_TPMS_TIME_INFO() {
    assert_eq!(::std::mem::size_of::<TPMS_TIME_INFO>() , 32usize , concat ! (
               "Size of: " , stringify ! ( TPMS_TIME_INFO ) ));
    assert_eq! (::std::mem::align_of::<TPMS_TIME_INFO>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( TPMS_TIME_INFO ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_TIME_INFO ) ) . time as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_TIME_INFO ) , "::"
                , stringify ! ( time ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_TIME_INFO ) ) . clockInfo as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_TIME_INFO ) , "::"
                , stringify ! ( clockInfo ) ));
}
impl Clone for TPMS_TIME_INFO {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMS_TIME_ATTEST_INFO {
    pub time: TPMS_TIME_INFO,
    pub firmwareVersion: UINT64,
}
#[test]
fn bindgen_test_layout_TPMS_TIME_ATTEST_INFO() {
    assert_eq!(::std::mem::size_of::<TPMS_TIME_ATTEST_INFO>() , 40usize ,
               concat ! ( "Size of: " , stringify ! ( TPMS_TIME_ATTEST_INFO )
               ));
    assert_eq! (::std::mem::align_of::<TPMS_TIME_ATTEST_INFO>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPMS_TIME_ATTEST_INFO ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_TIME_ATTEST_INFO ) ) . time as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_TIME_ATTEST_INFO )
                , "::" , stringify ! ( time ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_TIME_ATTEST_INFO ) ) .
                firmwareVersion as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_TIME_ATTEST_INFO )
                , "::" , stringify ! ( firmwareVersion ) ));
}
impl Clone for TPMS_TIME_ATTEST_INFO {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPMS_CERTIFY_INFO {
    pub name: TPM2B_NAME,
    pub qualifiedName: TPM2B_NAME,
}
#[test]
fn bindgen_test_layout_TPMS_CERTIFY_INFO() {
    assert_eq!(::std::mem::size_of::<TPMS_CERTIFY_INFO>() , 140usize , concat
               ! ( "Size of: " , stringify ! ( TPMS_CERTIFY_INFO ) ));
    assert_eq! (::std::mem::align_of::<TPMS_CERTIFY_INFO>() , 2usize , concat
                ! ( "Alignment of " , stringify ! ( TPMS_CERTIFY_INFO ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_CERTIFY_INFO ) ) . name as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_CERTIFY_INFO ) ,
                "::" , stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_CERTIFY_INFO ) ) . qualifiedName as
                * const _ as usize } , 70usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_CERTIFY_INFO ) ,
                "::" , stringify ! ( qualifiedName ) ));
}
impl Clone for TPMS_CERTIFY_INFO {
    fn clone(&self) -> Self { *self }
}
impl Default for TPMS_CERTIFY_INFO {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPMS_QUOTE_INFO {
    pub pcrSelect: TPML_PCR_SELECTION,
    pub pcrDigest: TPM2B_DIGEST,
}
#[test]
fn bindgen_test_layout_TPMS_QUOTE_INFO() {
    assert_eq!(::std::mem::size_of::<TPMS_QUOTE_INFO>() , 104usize , concat !
               ( "Size of: " , stringify ! ( TPMS_QUOTE_INFO ) ));
    assert_eq! (::std::mem::align_of::<TPMS_QUOTE_INFO>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( TPMS_QUOTE_INFO ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_QUOTE_INFO ) ) . pcrSelect as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_QUOTE_INFO ) ,
                "::" , stringify ! ( pcrSelect ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_QUOTE_INFO ) ) . pcrDigest as *
                const _ as usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_QUOTE_INFO ) ,
                "::" , stringify ! ( pcrDigest ) ));
}
impl Clone for TPMS_QUOTE_INFO {
    fn clone(&self) -> Self { *self }
}
impl Default for TPMS_QUOTE_INFO {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPMS_COMMAND_AUDIT_INFO {
    pub auditCounter: UINT64,
    pub digestAlg: TPM_ALG_ID,
    pub auditDigest: TPM2B_DIGEST,
    pub commandDigest: TPM2B_DIGEST,
}
#[test]
fn bindgen_test_layout_TPMS_COMMAND_AUDIT_INFO() {
    assert_eq!(::std::mem::size_of::<TPMS_COMMAND_AUDIT_INFO>() , 144usize ,
               concat ! (
               "Size of: " , stringify ! ( TPMS_COMMAND_AUDIT_INFO ) ));
    assert_eq! (::std::mem::align_of::<TPMS_COMMAND_AUDIT_INFO>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPMS_COMMAND_AUDIT_INFO ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_COMMAND_AUDIT_INFO ) ) .
                auditCounter as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_COMMAND_AUDIT_INFO
                ) , "::" , stringify ! ( auditCounter ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_COMMAND_AUDIT_INFO ) ) . digestAlg
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_COMMAND_AUDIT_INFO
                ) , "::" , stringify ! ( digestAlg ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_COMMAND_AUDIT_INFO ) ) . auditDigest
                as * const _ as usize } , 10usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_COMMAND_AUDIT_INFO
                ) , "::" , stringify ! ( auditDigest ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_COMMAND_AUDIT_INFO ) ) .
                commandDigest as * const _ as usize } , 76usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_COMMAND_AUDIT_INFO
                ) , "::" , stringify ! ( commandDigest ) ));
}
impl Clone for TPMS_COMMAND_AUDIT_INFO {
    fn clone(&self) -> Self { *self }
}
impl Default for TPMS_COMMAND_AUDIT_INFO {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPMS_SESSION_AUDIT_INFO {
    pub exclusiveSession: TPMI_YES_NO,
    pub sessionDigest: TPM2B_DIGEST,
}
#[test]
fn bindgen_test_layout_TPMS_SESSION_AUDIT_INFO() {
    assert_eq!(::std::mem::size_of::<TPMS_SESSION_AUDIT_INFO>() , 68usize ,
               concat ! (
               "Size of: " , stringify ! ( TPMS_SESSION_AUDIT_INFO ) ));
    assert_eq! (::std::mem::align_of::<TPMS_SESSION_AUDIT_INFO>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPMS_SESSION_AUDIT_INFO ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_SESSION_AUDIT_INFO ) ) .
                exclusiveSession as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_SESSION_AUDIT_INFO
                ) , "::" , stringify ! ( exclusiveSession ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_SESSION_AUDIT_INFO ) ) .
                sessionDigest as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_SESSION_AUDIT_INFO
                ) , "::" , stringify ! ( sessionDigest ) ));
}
impl Clone for TPMS_SESSION_AUDIT_INFO {
    fn clone(&self) -> Self { *self }
}
impl Default for TPMS_SESSION_AUDIT_INFO {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPMS_CREATION_INFO {
    pub objectName: TPM2B_NAME,
    pub creationHash: TPM2B_DIGEST,
}
#[test]
fn bindgen_test_layout_TPMS_CREATION_INFO() {
    assert_eq!(::std::mem::size_of::<TPMS_CREATION_INFO>() , 136usize , concat
               ! ( "Size of: " , stringify ! ( TPMS_CREATION_INFO ) ));
    assert_eq! (::std::mem::align_of::<TPMS_CREATION_INFO>() , 2usize , concat
                ! ( "Alignment of " , stringify ! ( TPMS_CREATION_INFO ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_CREATION_INFO ) ) . objectName as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_CREATION_INFO ) ,
                "::" , stringify ! ( objectName ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_CREATION_INFO ) ) . creationHash as
                * const _ as usize } , 70usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_CREATION_INFO ) ,
                "::" , stringify ! ( creationHash ) ));
}
impl Clone for TPMS_CREATION_INFO {
    fn clone(&self) -> Self { *self }
}
impl Default for TPMS_CREATION_INFO {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPMS_NV_CERTIFY_INFO {
    pub indexName: TPM2B_NAME,
    pub offset: UINT16,
    pub nvContents: TPM2B_MAX_NV_BUFFER,
}
#[test]
fn bindgen_test_layout_TPMS_NV_CERTIFY_INFO() {
    assert_eq!(::std::mem::size_of::<TPMS_NV_CERTIFY_INFO>() , 1098usize ,
               concat ! ( "Size of: " , stringify ! ( TPMS_NV_CERTIFY_INFO )
               ));
    assert_eq! (::std::mem::align_of::<TPMS_NV_CERTIFY_INFO>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPMS_NV_CERTIFY_INFO ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_NV_CERTIFY_INFO ) ) . indexName as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_NV_CERTIFY_INFO )
                , "::" , stringify ! ( indexName ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_NV_CERTIFY_INFO ) ) . offset as *
                const _ as usize } , 70usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_NV_CERTIFY_INFO )
                , "::" , stringify ! ( offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_NV_CERTIFY_INFO ) ) . nvContents as
                * const _ as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_NV_CERTIFY_INFO )
                , "::" , stringify ! ( nvContents ) ));
}
impl Clone for TPMS_NV_CERTIFY_INFO {
    fn clone(&self) -> Self { *self }
}
impl Default for TPMS_NV_CERTIFY_INFO {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
pub type TPMI_ST_ATTEST = TPM_ST;
#[repr(C)]
#[derive(Copy)]
pub struct TPMU_ATTEST {
    pub certify: __BindgenUnionField<TPMS_CERTIFY_INFO>,
    pub creation: __BindgenUnionField<TPMS_CREATION_INFO>,
    pub quote: __BindgenUnionField<TPMS_QUOTE_INFO>,
    pub commandAudit: __BindgenUnionField<TPMS_COMMAND_AUDIT_INFO>,
    pub sessionAudit: __BindgenUnionField<TPMS_SESSION_AUDIT_INFO>,
    pub time: __BindgenUnionField<TPMS_TIME_ATTEST_INFO>,
    pub nv: __BindgenUnionField<TPMS_NV_CERTIFY_INFO>,
    pub bindgen_union_field: [u64; 138usize],
}
#[test]
fn bindgen_test_layout_TPMU_ATTEST() {
    assert_eq!(::std::mem::size_of::<TPMU_ATTEST>() , 1104usize , concat ! (
               "Size of: " , stringify ! ( TPMU_ATTEST ) ));
    assert_eq! (::std::mem::align_of::<TPMU_ATTEST>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( TPMU_ATTEST ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_ATTEST ) ) . certify as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_ATTEST ) , "::" ,
                stringify ! ( certify ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_ATTEST ) ) . creation as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_ATTEST ) , "::" ,
                stringify ! ( creation ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_ATTEST ) ) . quote as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_ATTEST ) , "::" ,
                stringify ! ( quote ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_ATTEST ) ) . commandAudit as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_ATTEST ) , "::" ,
                stringify ! ( commandAudit ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_ATTEST ) ) . sessionAudit as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_ATTEST ) , "::" ,
                stringify ! ( sessionAudit ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_ATTEST ) ) . time as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_ATTEST ) , "::" ,
                stringify ! ( time ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_ATTEST ) ) . nv as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_ATTEST ) , "::" ,
                stringify ! ( nv ) ));
}
impl Clone for TPMU_ATTEST {
    fn clone(&self) -> Self { *self }
}
impl Default for TPMU_ATTEST {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPMS_ATTEST {
    pub magic: TPM_GENERATED,
    pub type_: TPMI_ST_ATTEST,
    pub qualifiedSigner: TPM2B_NAME,
    pub extraData: TPM2B_DATA,
    pub clockInfo: TPMS_CLOCK_INFO,
    pub firmwareVersion: UINT64,
    pub attested: TPMU_ATTEST,
}
#[test]
fn bindgen_test_layout_TPMS_ATTEST() {
    assert_eq!(::std::mem::size_of::<TPMS_ATTEST>() , 1280usize , concat ! (
               "Size of: " , stringify ! ( TPMS_ATTEST ) ));
    assert_eq! (::std::mem::align_of::<TPMS_ATTEST>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( TPMS_ATTEST ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_ATTEST ) ) . magic as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_ATTEST ) , "::" ,
                stringify ! ( magic ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_ATTEST ) ) . type_ as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_ATTEST ) , "::" ,
                stringify ! ( type_ ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_ATTEST ) ) . qualifiedSigner as *
                const _ as usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_ATTEST ) , "::" ,
                stringify ! ( qualifiedSigner ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_ATTEST ) ) . extraData as * const _
                as usize } , 76usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_ATTEST ) , "::" ,
                stringify ! ( extraData ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_ATTEST ) ) . clockInfo as * const _
                as usize } , 144usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_ATTEST ) , "::" ,
                stringify ! ( clockInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_ATTEST ) ) . firmwareVersion as *
                const _ as usize } , 168usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_ATTEST ) , "::" ,
                stringify ! ( firmwareVersion ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_ATTEST ) ) . attested as * const _
                as usize } , 176usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_ATTEST ) , "::" ,
                stringify ! ( attested ) ));
}
impl Clone for TPMS_ATTEST {
    fn clone(&self) -> Self { *self }
}
impl Default for TPMS_ATTEST {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPM2B_ATTEST {
    pub t: __BindgenUnionField<TPM2B_ATTEST__bindgen_ty_1>,
    pub b: __BindgenUnionField<TPM2B>,
    pub bindgen_union_field: [u16; 641usize],
}
#[repr(C)]
pub struct TPM2B_ATTEST__bindgen_ty_1 {
    pub size: UINT16,
    pub attestationData: [BYTE; 1280usize],
}
#[test]
fn bindgen_test_layout_TPM2B_ATTEST__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<TPM2B_ATTEST__bindgen_ty_1>() , 1282usize
               , concat ! (
               "Size of: " , stringify ! ( TPM2B_ATTEST__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<TPM2B_ATTEST__bindgen_ty_1>() , 2usize
                , concat ! (
                "Alignment of " , stringify ! ( TPM2B_ATTEST__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_ATTEST__bindgen_ty_1 ) ) . size as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_ATTEST__bindgen_ty_1 ) , "::" , stringify ! ( size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_ATTEST__bindgen_ty_1 ) ) .
                attestationData as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_ATTEST__bindgen_ty_1 ) , "::" , stringify ! (
                attestationData ) ));
}
impl Default for TPM2B_ATTEST__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_TPM2B_ATTEST() {
    assert_eq!(::std::mem::size_of::<TPM2B_ATTEST>() , 1282usize , concat ! (
               "Size of: " , stringify ! ( TPM2B_ATTEST ) ));
    assert_eq! (::std::mem::align_of::<TPM2B_ATTEST>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( TPM2B_ATTEST ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_ATTEST ) ) . t as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_ATTEST ) , "::" ,
                stringify ! ( t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_ATTEST ) ) . b as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_ATTEST ) , "::" ,
                stringify ! ( b ) ));
}
impl Clone for TPM2B_ATTEST {
    fn clone(&self) -> Self { *self }
}
impl Default for TPM2B_ATTEST {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPMS_AUTH_COMMAND {
    pub sessionHandle: TPMI_SH_AUTH_SESSION,
    pub nonce: TPM2B_NONCE,
    pub sessionAttributes: TPMA_SESSION,
    pub hmac: TPM2B_AUTH,
}
#[test]
fn bindgen_test_layout_TPMS_AUTH_COMMAND() {
    assert_eq!(::std::mem::size_of::<TPMS_AUTH_COMMAND>() , 144usize , concat
               ! ( "Size of: " , stringify ! ( TPMS_AUTH_COMMAND ) ));
    assert_eq! (::std::mem::align_of::<TPMS_AUTH_COMMAND>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( TPMS_AUTH_COMMAND ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_AUTH_COMMAND ) ) . sessionHandle as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_AUTH_COMMAND ) ,
                "::" , stringify ! ( sessionHandle ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_AUTH_COMMAND ) ) . nonce as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_AUTH_COMMAND ) ,
                "::" , stringify ! ( nonce ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_AUTH_COMMAND ) ) . sessionAttributes
                as * const _ as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_AUTH_COMMAND ) ,
                "::" , stringify ! ( sessionAttributes ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_AUTH_COMMAND ) ) . hmac as * const _
                as usize } , 76usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_AUTH_COMMAND ) ,
                "::" , stringify ! ( hmac ) ));
}
impl Clone for TPMS_AUTH_COMMAND {
    fn clone(&self) -> Self { *self }
}
impl Default for TPMS_AUTH_COMMAND {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPMS_AUTH_RESPONSE {
    pub nonce: TPM2B_NONCE,
    pub sessionAttributes: TPMA_SESSION,
    pub hmac: TPM2B_AUTH,
}
#[test]
fn bindgen_test_layout_TPMS_AUTH_RESPONSE() {
    assert_eq!(::std::mem::size_of::<TPMS_AUTH_RESPONSE>() , 140usize , concat
               ! ( "Size of: " , stringify ! ( TPMS_AUTH_RESPONSE ) ));
    assert_eq! (::std::mem::align_of::<TPMS_AUTH_RESPONSE>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( TPMS_AUTH_RESPONSE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_AUTH_RESPONSE ) ) . nonce as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_AUTH_RESPONSE ) ,
                "::" , stringify ! ( nonce ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_AUTH_RESPONSE ) ) .
                sessionAttributes as * const _ as usize } , 68usize , concat !
                (
                "Alignment of field: " , stringify ! ( TPMS_AUTH_RESPONSE ) ,
                "::" , stringify ! ( sessionAttributes ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_AUTH_RESPONSE ) ) . hmac as * const
                _ as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_AUTH_RESPONSE ) ,
                "::" , stringify ! ( hmac ) ));
}
impl Clone for TPMS_AUTH_RESPONSE {
    fn clone(&self) -> Self { *self }
}
impl Default for TPMS_AUTH_RESPONSE {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
pub type TPMI_AES_KEY_BITS = TPM_KEY_BITS;
pub type TPMI_SM4_KEY_BITS = TPM_KEY_BITS;
pub type TPMI_CAMELLIA_KEY_BITS = TPM_KEY_BITS;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMU_SYM_KEY_BITS {
    pub aes: __BindgenUnionField<TPMI_AES_KEY_BITS>,
    pub sm4: __BindgenUnionField<TPMI_SM4_KEY_BITS>,
    pub sym: __BindgenUnionField<TPM_KEY_BITS>,
    pub exclusiveOr: __BindgenUnionField<TPMI_ALG_HASH>,
    pub bindgen_union_field: u16,
}
#[test]
fn bindgen_test_layout_TPMU_SYM_KEY_BITS() {
    assert_eq!(::std::mem::size_of::<TPMU_SYM_KEY_BITS>() , 2usize , concat !
               ( "Size of: " , stringify ! ( TPMU_SYM_KEY_BITS ) ));
    assert_eq! (::std::mem::align_of::<TPMU_SYM_KEY_BITS>() , 2usize , concat
                ! ( "Alignment of " , stringify ! ( TPMU_SYM_KEY_BITS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_SYM_KEY_BITS ) ) . aes as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_SYM_KEY_BITS ) ,
                "::" , stringify ! ( aes ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_SYM_KEY_BITS ) ) . sm4 as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_SYM_KEY_BITS ) ,
                "::" , stringify ! ( sm4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_SYM_KEY_BITS ) ) . sym as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_SYM_KEY_BITS ) ,
                "::" , stringify ! ( sym ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_SYM_KEY_BITS ) ) . exclusiveOr as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_SYM_KEY_BITS ) ,
                "::" , stringify ! ( exclusiveOr ) ));
}
impl Clone for TPMU_SYM_KEY_BITS {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMU_SYM_MODE {
    pub aes: __BindgenUnionField<TPMI_ALG_SYM_MODE>,
    pub sm4: __BindgenUnionField<TPMI_ALG_SYM_MODE>,
    pub sym: __BindgenUnionField<TPMI_ALG_SYM_MODE>,
    pub bindgen_union_field: u16,
}
#[test]
fn bindgen_test_layout_TPMU_SYM_MODE() {
    assert_eq!(::std::mem::size_of::<TPMU_SYM_MODE>() , 2usize , concat ! (
               "Size of: " , stringify ! ( TPMU_SYM_MODE ) ));
    assert_eq! (::std::mem::align_of::<TPMU_SYM_MODE>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( TPMU_SYM_MODE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_SYM_MODE ) ) . aes as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_SYM_MODE ) , "::"
                , stringify ! ( aes ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_SYM_MODE ) ) . sm4 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_SYM_MODE ) , "::"
                , stringify ! ( sm4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_SYM_MODE ) ) . sym as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_SYM_MODE ) , "::"
                , stringify ! ( sym ) ));
}
impl Clone for TPMU_SYM_MODE {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMT_SYM_DEF {
    pub algorithm: TPMI_ALG_SYM,
    pub keyBits: TPMU_SYM_KEY_BITS,
    pub mode: TPMU_SYM_MODE,
}
#[test]
fn bindgen_test_layout_TPMT_SYM_DEF() {
    assert_eq!(::std::mem::size_of::<TPMT_SYM_DEF>() , 6usize , concat ! (
               "Size of: " , stringify ! ( TPMT_SYM_DEF ) ));
    assert_eq! (::std::mem::align_of::<TPMT_SYM_DEF>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( TPMT_SYM_DEF ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_SYM_DEF ) ) . algorithm as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_SYM_DEF ) , "::" ,
                stringify ! ( algorithm ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_SYM_DEF ) ) . keyBits as * const _
                as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_SYM_DEF ) , "::" ,
                stringify ! ( keyBits ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_SYM_DEF ) ) . mode as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_SYM_DEF ) , "::" ,
                stringify ! ( mode ) ));
}
impl Clone for TPMT_SYM_DEF {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMT_SYM_DEF_OBJECT {
    pub algorithm: TPMI_ALG_SYM_OBJECT,
    pub keyBits: TPMU_SYM_KEY_BITS,
    pub mode: TPMU_SYM_MODE,
}
#[test]
fn bindgen_test_layout_TPMT_SYM_DEF_OBJECT() {
    assert_eq!(::std::mem::size_of::<TPMT_SYM_DEF_OBJECT>() , 6usize , concat
               ! ( "Size of: " , stringify ! ( TPMT_SYM_DEF_OBJECT ) ));
    assert_eq! (::std::mem::align_of::<TPMT_SYM_DEF_OBJECT>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPMT_SYM_DEF_OBJECT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_SYM_DEF_OBJECT ) ) . algorithm as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_SYM_DEF_OBJECT ) ,
                "::" , stringify ! ( algorithm ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_SYM_DEF_OBJECT ) ) . keyBits as *
                const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_SYM_DEF_OBJECT ) ,
                "::" , stringify ! ( keyBits ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_SYM_DEF_OBJECT ) ) . mode as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_SYM_DEF_OBJECT ) ,
                "::" , stringify ! ( mode ) ));
}
impl Clone for TPMT_SYM_DEF_OBJECT {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPM2B_SYM_KEY {
    pub t: __BindgenUnionField<TPM2B_SYM_KEY__bindgen_ty_1>,
    pub b: __BindgenUnionField<TPM2B>,
    pub bindgen_union_field: [u16; 17usize],
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPM2B_SYM_KEY__bindgen_ty_1 {
    pub size: UINT16,
    pub buffer: [BYTE; 32usize],
}
#[test]
fn bindgen_test_layout_TPM2B_SYM_KEY__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<TPM2B_SYM_KEY__bindgen_ty_1>() , 34usize
               , concat ! (
               "Size of: " , stringify ! ( TPM2B_SYM_KEY__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<TPM2B_SYM_KEY__bindgen_ty_1>() , 2usize
                , concat ! (
                "Alignment of " , stringify ! ( TPM2B_SYM_KEY__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_SYM_KEY__bindgen_ty_1 ) ) . size as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_SYM_KEY__bindgen_ty_1 ) , "::" , stringify ! ( size )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_SYM_KEY__bindgen_ty_1 ) ) . buffer
                as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_SYM_KEY__bindgen_ty_1 ) , "::" , stringify ! ( buffer )
                ));
}
impl Clone for TPM2B_SYM_KEY__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_TPM2B_SYM_KEY() {
    assert_eq!(::std::mem::size_of::<TPM2B_SYM_KEY>() , 34usize , concat ! (
               "Size of: " , stringify ! ( TPM2B_SYM_KEY ) ));
    assert_eq! (::std::mem::align_of::<TPM2B_SYM_KEY>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( TPM2B_SYM_KEY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_SYM_KEY ) ) . t as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_SYM_KEY ) , "::"
                , stringify ! ( t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_SYM_KEY ) ) . b as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_SYM_KEY ) , "::"
                , stringify ! ( b ) ));
}
impl Clone for TPM2B_SYM_KEY {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMS_SYMCIPHER_PARMS {
    pub sym: TPMT_SYM_DEF_OBJECT,
}
#[test]
fn bindgen_test_layout_TPMS_SYMCIPHER_PARMS() {
    assert_eq!(::std::mem::size_of::<TPMS_SYMCIPHER_PARMS>() , 6usize , concat
               ! ( "Size of: " , stringify ! ( TPMS_SYMCIPHER_PARMS ) ));
    assert_eq! (::std::mem::align_of::<TPMS_SYMCIPHER_PARMS>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPMS_SYMCIPHER_PARMS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_SYMCIPHER_PARMS ) ) . sym as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_SYMCIPHER_PARMS )
                , "::" , stringify ! ( sym ) ));
}
impl Clone for TPMS_SYMCIPHER_PARMS {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPM2B_SENSITIVE_DATA {
    pub t: __BindgenUnionField<TPM2B_SENSITIVE_DATA__bindgen_ty_1>,
    pub b: __BindgenUnionField<TPM2B>,
    pub bindgen_union_field: [u16; 65usize],
}
#[repr(C)]
pub struct TPM2B_SENSITIVE_DATA__bindgen_ty_1 {
    pub size: UINT16,
    pub buffer: [BYTE; 128usize],
}
#[test]
fn bindgen_test_layout_TPM2B_SENSITIVE_DATA__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<TPM2B_SENSITIVE_DATA__bindgen_ty_1>() ,
               130usize , concat ! (
               "Size of: " , stringify ! ( TPM2B_SENSITIVE_DATA__bindgen_ty_1
               ) ));
    assert_eq! (::std::mem::align_of::<TPM2B_SENSITIVE_DATA__bindgen_ty_1>() ,
                2usize , concat ! (
                "Alignment of " , stringify ! (
                TPM2B_SENSITIVE_DATA__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_SENSITIVE_DATA__bindgen_ty_1 ) ) .
                size as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_SENSITIVE_DATA__bindgen_ty_1 ) , "::" , stringify ! (
                size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_SENSITIVE_DATA__bindgen_ty_1 ) ) .
                buffer as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_SENSITIVE_DATA__bindgen_ty_1 ) , "::" , stringify ! (
                buffer ) ));
}
impl Default for TPM2B_SENSITIVE_DATA__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_TPM2B_SENSITIVE_DATA() {
    assert_eq!(::std::mem::size_of::<TPM2B_SENSITIVE_DATA>() , 130usize ,
               concat ! ( "Size of: " , stringify ! ( TPM2B_SENSITIVE_DATA )
               ));
    assert_eq! (::std::mem::align_of::<TPM2B_SENSITIVE_DATA>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPM2B_SENSITIVE_DATA ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_SENSITIVE_DATA ) ) . t as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_SENSITIVE_DATA )
                , "::" , stringify ! ( t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_SENSITIVE_DATA ) ) . b as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_SENSITIVE_DATA )
                , "::" , stringify ! ( b ) ));
}
impl Clone for TPM2B_SENSITIVE_DATA {
    fn clone(&self) -> Self { *self }
}
impl Default for TPM2B_SENSITIVE_DATA {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPMS_SENSITIVE_CREATE {
    pub userAuth: TPM2B_AUTH,
    pub data: TPM2B_SENSITIVE_DATA,
}
#[test]
fn bindgen_test_layout_TPMS_SENSITIVE_CREATE() {
    assert_eq!(::std::mem::size_of::<TPMS_SENSITIVE_CREATE>() , 196usize ,
               concat ! ( "Size of: " , stringify ! ( TPMS_SENSITIVE_CREATE )
               ));
    assert_eq! (::std::mem::align_of::<TPMS_SENSITIVE_CREATE>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPMS_SENSITIVE_CREATE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_SENSITIVE_CREATE ) ) . userAuth as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_SENSITIVE_CREATE )
                , "::" , stringify ! ( userAuth ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_SENSITIVE_CREATE ) ) . data as *
                const _ as usize } , 66usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_SENSITIVE_CREATE )
                , "::" , stringify ! ( data ) ));
}
impl Clone for TPMS_SENSITIVE_CREATE {
    fn clone(&self) -> Self { *self }
}
impl Default for TPMS_SENSITIVE_CREATE {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPM2B_SENSITIVE_CREATE {
    pub t: __BindgenUnionField<TPM2B_SENSITIVE_CREATE__bindgen_ty_1>,
    pub b: __BindgenUnionField<TPM2B>,
    pub bindgen_union_field: [u16; 99usize],
}
#[repr(C)]
#[derive(Copy)]
pub struct TPM2B_SENSITIVE_CREATE__bindgen_ty_1 {
    pub size: UINT16,
    pub sensitive: TPMS_SENSITIVE_CREATE,
}
#[test]
fn bindgen_test_layout_TPM2B_SENSITIVE_CREATE__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<TPM2B_SENSITIVE_CREATE__bindgen_ty_1>() ,
               198usize , concat ! (
               "Size of: " , stringify ! (
               TPM2B_SENSITIVE_CREATE__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<TPM2B_SENSITIVE_CREATE__bindgen_ty_1>()
                , 2usize , concat ! (
                "Alignment of " , stringify ! (
                TPM2B_SENSITIVE_CREATE__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_SENSITIVE_CREATE__bindgen_ty_1 ) )
                . size as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_SENSITIVE_CREATE__bindgen_ty_1 ) , "::" , stringify ! (
                size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_SENSITIVE_CREATE__bindgen_ty_1 ) )
                . sensitive as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_SENSITIVE_CREATE__bindgen_ty_1 ) , "::" , stringify ! (
                sensitive ) ));
}
impl Clone for TPM2B_SENSITIVE_CREATE__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for TPM2B_SENSITIVE_CREATE__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_TPM2B_SENSITIVE_CREATE() {
    assert_eq!(::std::mem::size_of::<TPM2B_SENSITIVE_CREATE>() , 198usize ,
               concat ! ( "Size of: " , stringify ! ( TPM2B_SENSITIVE_CREATE )
               ));
    assert_eq! (::std::mem::align_of::<TPM2B_SENSITIVE_CREATE>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPM2B_SENSITIVE_CREATE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_SENSITIVE_CREATE ) ) . t as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_SENSITIVE_CREATE
                ) , "::" , stringify ! ( t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_SENSITIVE_CREATE ) ) . b as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_SENSITIVE_CREATE
                ) , "::" , stringify ! ( b ) ));
}
impl Clone for TPM2B_SENSITIVE_CREATE {
    fn clone(&self) -> Self { *self }
}
impl Default for TPM2B_SENSITIVE_CREATE {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMS_SCHEME_HASH {
    pub hashAlg: TPMI_ALG_HASH,
}
#[test]
fn bindgen_test_layout_TPMS_SCHEME_HASH() {
    assert_eq!(::std::mem::size_of::<TPMS_SCHEME_HASH>() , 2usize , concat ! (
               "Size of: " , stringify ! ( TPMS_SCHEME_HASH ) ));
    assert_eq! (::std::mem::align_of::<TPMS_SCHEME_HASH>() , 2usize , concat !
                ( "Alignment of " , stringify ! ( TPMS_SCHEME_HASH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_SCHEME_HASH ) ) . hashAlg as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_SCHEME_HASH ) ,
                "::" , stringify ! ( hashAlg ) ));
}
impl Clone for TPMS_SCHEME_HASH {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMS_SCHEME_ECDAA {
    pub hashAlg: TPMI_ALG_HASH,
    pub count: UINT16,
}
#[test]
fn bindgen_test_layout_TPMS_SCHEME_ECDAA() {
    assert_eq!(::std::mem::size_of::<TPMS_SCHEME_ECDAA>() , 4usize , concat !
               ( "Size of: " , stringify ! ( TPMS_SCHEME_ECDAA ) ));
    assert_eq! (::std::mem::align_of::<TPMS_SCHEME_ECDAA>() , 2usize , concat
                ! ( "Alignment of " , stringify ! ( TPMS_SCHEME_ECDAA ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_SCHEME_ECDAA ) ) . hashAlg as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_SCHEME_ECDAA ) ,
                "::" , stringify ! ( hashAlg ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_SCHEME_ECDAA ) ) . count as * const
                _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_SCHEME_ECDAA ) ,
                "::" , stringify ! ( count ) ));
}
impl Clone for TPMS_SCHEME_ECDAA {
    fn clone(&self) -> Self { *self }
}
pub type TPMI_ALG_KEYEDHASH_SCHEME = TPM_ALG_ID;
pub type TPMS_SCHEME_HMAC = TPMS_SCHEME_HASH;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMS_SCHEME_XOR {
    pub hashAlg: TPMI_ALG_HASH,
    pub kdf: TPMI_ALG_KDF,
}
#[test]
fn bindgen_test_layout_TPMS_SCHEME_XOR() {
    assert_eq!(::std::mem::size_of::<TPMS_SCHEME_XOR>() , 4usize , concat ! (
               "Size of: " , stringify ! ( TPMS_SCHEME_XOR ) ));
    assert_eq! (::std::mem::align_of::<TPMS_SCHEME_XOR>() , 2usize , concat !
                ( "Alignment of " , stringify ! ( TPMS_SCHEME_XOR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_SCHEME_XOR ) ) . hashAlg as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_SCHEME_XOR ) ,
                "::" , stringify ! ( hashAlg ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_SCHEME_XOR ) ) . kdf as * const _ as
                usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_SCHEME_XOR ) ,
                "::" , stringify ! ( kdf ) ));
}
impl Clone for TPMS_SCHEME_XOR {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMU_SCHEME_KEYEDHASH {
    pub hmac: __BindgenUnionField<TPMS_SCHEME_HMAC>,
    pub exclusiveOr: __BindgenUnionField<TPMS_SCHEME_XOR>,
    pub bindgen_union_field: [u16; 2usize],
}
#[test]
fn bindgen_test_layout_TPMU_SCHEME_KEYEDHASH() {
    assert_eq!(::std::mem::size_of::<TPMU_SCHEME_KEYEDHASH>() , 4usize ,
               concat ! ( "Size of: " , stringify ! ( TPMU_SCHEME_KEYEDHASH )
               ));
    assert_eq! (::std::mem::align_of::<TPMU_SCHEME_KEYEDHASH>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPMU_SCHEME_KEYEDHASH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_SCHEME_KEYEDHASH ) ) . hmac as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_SCHEME_KEYEDHASH )
                , "::" , stringify ! ( hmac ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_SCHEME_KEYEDHASH ) ) . exclusiveOr
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_SCHEME_KEYEDHASH )
                , "::" , stringify ! ( exclusiveOr ) ));
}
impl Clone for TPMU_SCHEME_KEYEDHASH {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMT_KEYEDHASH_SCHEME {
    pub scheme: TPMI_ALG_KEYEDHASH_SCHEME,
    pub details: TPMU_SCHEME_KEYEDHASH,
}
#[test]
fn bindgen_test_layout_TPMT_KEYEDHASH_SCHEME() {
    assert_eq!(::std::mem::size_of::<TPMT_KEYEDHASH_SCHEME>() , 6usize ,
               concat ! ( "Size of: " , stringify ! ( TPMT_KEYEDHASH_SCHEME )
               ));
    assert_eq! (::std::mem::align_of::<TPMT_KEYEDHASH_SCHEME>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPMT_KEYEDHASH_SCHEME ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_KEYEDHASH_SCHEME ) ) . scheme as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_KEYEDHASH_SCHEME )
                , "::" , stringify ! ( scheme ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_KEYEDHASH_SCHEME ) ) . details as *
                const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_KEYEDHASH_SCHEME )
                , "::" , stringify ! ( details ) ));
}
impl Clone for TPMT_KEYEDHASH_SCHEME {
    fn clone(&self) -> Self { *self }
}
pub type TPMS_SIG_SCHEME_RSASSA = TPMS_SCHEME_HASH;
pub type TPMS_SIG_SCHEME_RSAPSS = TPMS_SCHEME_HASH;
pub type TPMS_SIG_SCHEME_ECDSA = TPMS_SCHEME_HASH;
pub type TPMS_SIG_SCHEME_SM2 = TPMS_SCHEME_HASH;
pub type TPMS_SIG_SCHEME_ECSCHNORR = TPMS_SCHEME_HASH;
pub type TPMS_SIG_SCHEME_ECDAA = TPMS_SCHEME_ECDAA;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMU_SIG_SCHEME {
    pub rsassa: __BindgenUnionField<TPMS_SIG_SCHEME_RSASSA>,
    pub rsapss: __BindgenUnionField<TPMS_SIG_SCHEME_RSAPSS>,
    pub ecdsa: __BindgenUnionField<TPMS_SIG_SCHEME_ECDSA>,
    pub ecdaa: __BindgenUnionField<TPMS_SIG_SCHEME_ECDAA>,
    pub sm2: __BindgenUnionField<TPMS_SIG_SCHEME_SM2>,
    pub ecschnorr: __BindgenUnionField<TPMS_SIG_SCHEME_ECSCHNORR>,
    pub hmac: __BindgenUnionField<TPMS_SCHEME_HMAC>,
    pub any: __BindgenUnionField<TPMS_SCHEME_HASH>,
    pub bindgen_union_field: [u16; 2usize],
}
#[test]
fn bindgen_test_layout_TPMU_SIG_SCHEME() {
    assert_eq!(::std::mem::size_of::<TPMU_SIG_SCHEME>() , 4usize , concat ! (
               "Size of: " , stringify ! ( TPMU_SIG_SCHEME ) ));
    assert_eq! (::std::mem::align_of::<TPMU_SIG_SCHEME>() , 2usize , concat !
                ( "Alignment of " , stringify ! ( TPMU_SIG_SCHEME ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_SIG_SCHEME ) ) . rsassa as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_SIG_SCHEME ) ,
                "::" , stringify ! ( rsassa ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_SIG_SCHEME ) ) . rsapss as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_SIG_SCHEME ) ,
                "::" , stringify ! ( rsapss ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_SIG_SCHEME ) ) . ecdsa as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_SIG_SCHEME ) ,
                "::" , stringify ! ( ecdsa ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_SIG_SCHEME ) ) . ecdaa as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_SIG_SCHEME ) ,
                "::" , stringify ! ( ecdaa ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_SIG_SCHEME ) ) . sm2 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_SIG_SCHEME ) ,
                "::" , stringify ! ( sm2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_SIG_SCHEME ) ) . ecschnorr as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_SIG_SCHEME ) ,
                "::" , stringify ! ( ecschnorr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_SIG_SCHEME ) ) . hmac as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_SIG_SCHEME ) ,
                "::" , stringify ! ( hmac ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_SIG_SCHEME ) ) . any as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_SIG_SCHEME ) ,
                "::" , stringify ! ( any ) ));
}
impl Clone for TPMU_SIG_SCHEME {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMT_SIG_SCHEME {
    pub scheme: TPMI_ALG_SIG_SCHEME,
    pub details: TPMU_SIG_SCHEME,
}
#[test]
fn bindgen_test_layout_TPMT_SIG_SCHEME() {
    assert_eq!(::std::mem::size_of::<TPMT_SIG_SCHEME>() , 6usize , concat ! (
               "Size of: " , stringify ! ( TPMT_SIG_SCHEME ) ));
    assert_eq! (::std::mem::align_of::<TPMT_SIG_SCHEME>() , 2usize , concat !
                ( "Alignment of " , stringify ! ( TPMT_SIG_SCHEME ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_SIG_SCHEME ) ) . scheme as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_SIG_SCHEME ) ,
                "::" , stringify ! ( scheme ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_SIG_SCHEME ) ) . details as * const
                _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_SIG_SCHEME ) ,
                "::" , stringify ! ( details ) ));
}
impl Clone for TPMT_SIG_SCHEME {
    fn clone(&self) -> Self { *self }
}
pub type TPMS_ENC_SCHEME_OAEP = TPMS_SCHEME_HASH;
pub type TPMS_ENC_SCHEME_RSAES = TPMS_EMPTY;
pub type TPMS_KEY_SCHEME_ECDH = TPMS_SCHEME_HASH;
pub type TPMS_KEY_SCHEME_ECMQV = TPMS_SCHEME_HASH;
pub type TPMS_SCHEME_MGF1 = TPMS_SCHEME_HASH;
pub type TPMS_SCHEME_KDF1_SP800_56A = TPMS_SCHEME_HASH;
pub type TPMS_SCHEME_KDF2 = TPMS_SCHEME_HASH;
pub type TPMS_SCHEME_KDF1_SP800_108 = TPMS_SCHEME_HASH;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMU_KDF_SCHEME {
    pub mgf1: __BindgenUnionField<TPMS_SCHEME_MGF1>,
    pub kdf1_sp800_56a: __BindgenUnionField<TPMS_SCHEME_KDF1_SP800_56A>,
    pub kdf1_sp800_108: __BindgenUnionField<TPMS_SCHEME_KDF1_SP800_108>,
    pub bindgen_union_field: u16,
}
#[test]
fn bindgen_test_layout_TPMU_KDF_SCHEME() {
    assert_eq!(::std::mem::size_of::<TPMU_KDF_SCHEME>() , 2usize , concat ! (
               "Size of: " , stringify ! ( TPMU_KDF_SCHEME ) ));
    assert_eq! (::std::mem::align_of::<TPMU_KDF_SCHEME>() , 2usize , concat !
                ( "Alignment of " , stringify ! ( TPMU_KDF_SCHEME ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_KDF_SCHEME ) ) . mgf1 as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_KDF_SCHEME ) ,
                "::" , stringify ! ( mgf1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_KDF_SCHEME ) ) . kdf1_sp800_56a as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_KDF_SCHEME ) ,
                "::" , stringify ! ( kdf1_sp800_56a ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_KDF_SCHEME ) ) . kdf1_sp800_108 as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_KDF_SCHEME ) ,
                "::" , stringify ! ( kdf1_sp800_108 ) ));
}
impl Clone for TPMU_KDF_SCHEME {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMT_KDF_SCHEME {
    pub scheme: TPMI_ALG_KDF,
    pub details: TPMU_KDF_SCHEME,
}
#[test]
fn bindgen_test_layout_TPMT_KDF_SCHEME() {
    assert_eq!(::std::mem::size_of::<TPMT_KDF_SCHEME>() , 4usize , concat ! (
               "Size of: " , stringify ! ( TPMT_KDF_SCHEME ) ));
    assert_eq! (::std::mem::align_of::<TPMT_KDF_SCHEME>() , 2usize , concat !
                ( "Alignment of " , stringify ! ( TPMT_KDF_SCHEME ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_KDF_SCHEME ) ) . scheme as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_KDF_SCHEME ) ,
                "::" , stringify ! ( scheme ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_KDF_SCHEME ) ) . details as * const
                _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_KDF_SCHEME ) ,
                "::" , stringify ! ( details ) ));
}
impl Clone for TPMT_KDF_SCHEME {
    fn clone(&self) -> Self { *self }
}
pub type TPMI_ALG_ASYM_SCHEME = TPM_ALG_ID;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMU_ASYM_SCHEME {
    pub ecdh: __BindgenUnionField<TPMS_KEY_SCHEME_ECDH>,
    pub rsassa: __BindgenUnionField<TPMS_SIG_SCHEME_RSASSA>,
    pub rsapss: __BindgenUnionField<TPMS_SIG_SCHEME_RSAPSS>,
    pub ecdsa: __BindgenUnionField<TPMS_SIG_SCHEME_ECDSA>,
    pub ecdaa: __BindgenUnionField<TPMS_SIG_SCHEME_ECDAA>,
    pub sm2: __BindgenUnionField<TPMS_SIG_SCHEME_SM2>,
    pub ecschnorr: __BindgenUnionField<TPMS_SIG_SCHEME_ECSCHNORR>,
    pub rsaes: __BindgenUnionField<TPMS_ENC_SCHEME_RSAES>,
    pub oaep: __BindgenUnionField<TPMS_ENC_SCHEME_OAEP>,
    pub anySig: __BindgenUnionField<TPMS_SCHEME_HASH>,
    pub bindgen_union_field: [u16; 2usize],
}
#[test]
fn bindgen_test_layout_TPMU_ASYM_SCHEME() {
    assert_eq!(::std::mem::size_of::<TPMU_ASYM_SCHEME>() , 4usize , concat ! (
               "Size of: " , stringify ! ( TPMU_ASYM_SCHEME ) ));
    assert_eq! (::std::mem::align_of::<TPMU_ASYM_SCHEME>() , 2usize , concat !
                ( "Alignment of " , stringify ! ( TPMU_ASYM_SCHEME ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_ASYM_SCHEME ) ) . ecdh as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_ASYM_SCHEME ) ,
                "::" , stringify ! ( ecdh ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_ASYM_SCHEME ) ) . rsassa as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_ASYM_SCHEME ) ,
                "::" , stringify ! ( rsassa ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_ASYM_SCHEME ) ) . rsapss as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_ASYM_SCHEME ) ,
                "::" , stringify ! ( rsapss ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_ASYM_SCHEME ) ) . ecdsa as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_ASYM_SCHEME ) ,
                "::" , stringify ! ( ecdsa ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_ASYM_SCHEME ) ) . ecdaa as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_ASYM_SCHEME ) ,
                "::" , stringify ! ( ecdaa ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_ASYM_SCHEME ) ) . sm2 as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_ASYM_SCHEME ) ,
                "::" , stringify ! ( sm2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_ASYM_SCHEME ) ) . ecschnorr as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_ASYM_SCHEME ) ,
                "::" , stringify ! ( ecschnorr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_ASYM_SCHEME ) ) . rsaes as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_ASYM_SCHEME ) ,
                "::" , stringify ! ( rsaes ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_ASYM_SCHEME ) ) . oaep as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_ASYM_SCHEME ) ,
                "::" , stringify ! ( oaep ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMU_ASYM_SCHEME ) ) . anySig as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMU_ASYM_SCHEME ) ,
                "::" , stringify ! ( anySig ) ));
}
impl Clone for TPMU_ASYM_SCHEME {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMT_ASYM_SCHEME {
    pub scheme: TPMI_ALG_ASYM_SCHEME,
    pub details: TPMU_ASYM_SCHEME,
}
#[test]
fn bindgen_test_layout_TPMT_ASYM_SCHEME() {
    assert_eq!(::std::mem::size_of::<TPMT_ASYM_SCHEME>() , 6usize , concat ! (
               "Size of: " , stringify ! ( TPMT_ASYM_SCHEME ) ));
    assert_eq! (::std::mem::align_of::<TPMT_ASYM_SCHEME>() , 2usize , concat !
                ( "Alignment of " , stringify ! ( TPMT_ASYM_SCHEME ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_ASYM_SCHEME ) ) . scheme as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_ASYM_SCHEME ) ,
                "::" , stringify ! ( scheme ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_ASYM_SCHEME ) ) . details as * const
                _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_ASYM_SCHEME ) ,
                "::" , stringify ! ( details ) ));
}
impl Clone for TPMT_ASYM_SCHEME {
    fn clone(&self) -> Self { *self }
}
pub type TPMI_ALG_RSA_SCHEME = TPM_ALG_ID;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMT_RSA_SCHEME {
    pub scheme: TPMI_ALG_RSA_SCHEME,
    pub details: TPMU_ASYM_SCHEME,
}
#[test]
fn bindgen_test_layout_TPMT_RSA_SCHEME() {
    assert_eq!(::std::mem::size_of::<TPMT_RSA_SCHEME>() , 6usize , concat ! (
               "Size of: " , stringify ! ( TPMT_RSA_SCHEME ) ));
    assert_eq! (::std::mem::align_of::<TPMT_RSA_SCHEME>() , 2usize , concat !
                ( "Alignment of " , stringify ! ( TPMT_RSA_SCHEME ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_RSA_SCHEME ) ) . scheme as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_RSA_SCHEME ) ,
                "::" , stringify ! ( scheme ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_RSA_SCHEME ) ) . details as * const
                _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_RSA_SCHEME ) ,
                "::" , stringify ! ( details ) ));
}
impl Clone for TPMT_RSA_SCHEME {
    fn clone(&self) -> Self { *self }
}
pub type TPMI_ALG_RSA_DECRYPT = TPM_ALG_ID;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMT_RSA_DECRYPT {
    pub scheme: TPMI_ALG_RSA_DECRYPT,
    pub details: TPMU_ASYM_SCHEME,
}
#[test]
fn bindgen_test_layout_TPMT_RSA_DECRYPT() {
    assert_eq!(::std::mem::size_of::<TPMT_RSA_DECRYPT>() , 6usize , concat ! (
               "Size of: " , stringify ! ( TPMT_RSA_DECRYPT ) ));
    assert_eq! (::std::mem::align_of::<TPMT_RSA_DECRYPT>() , 2usize , concat !
                ( "Alignment of " , stringify ! ( TPMT_RSA_DECRYPT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_RSA_DECRYPT ) ) . scheme as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_RSA_DECRYPT ) ,
                "::" , stringify ! ( scheme ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMT_RSA_DECRYPT ) ) . details as * const
                _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMT_RSA_DECRYPT ) ,
                "::" , stringify ! ( details ) ));
}
impl Clone for TPMT_RSA_DECRYPT {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPM2B_PUBLIC_KEY_RSA {
    pub t: __BindgenUnionField<TPM2B_PUBLIC_KEY_RSA__bindgen_ty_1>,
    pub b: __BindgenUnionField<TPM2B>,
    pub bindgen_union_field: [u16; 129usize],
}
#[repr(C)]
pub struct TPM2B_PUBLIC_KEY_RSA__bindgen_ty_1 {
    pub size: UINT16,
    pub buffer: [BYTE; 256usize],
}
#[test]
fn bindgen_test_layout_TPM2B_PUBLIC_KEY_RSA__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<TPM2B_PUBLIC_KEY_RSA__bindgen_ty_1>() ,
               258usize , concat ! (
               "Size of: " , stringify ! ( TPM2B_PUBLIC_KEY_RSA__bindgen_ty_1
               ) ));
    assert_eq! (::std::mem::align_of::<TPM2B_PUBLIC_KEY_RSA__bindgen_ty_1>() ,
                2usize , concat ! (
                "Alignment of " , stringify ! (
                TPM2B_PUBLIC_KEY_RSA__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_PUBLIC_KEY_RSA__bindgen_ty_1 ) ) .
                size as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_PUBLIC_KEY_RSA__bindgen_ty_1 ) , "::" , stringify ! (
                size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_PUBLIC_KEY_RSA__bindgen_ty_1 ) ) .
                buffer as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_PUBLIC_KEY_RSA__bindgen_ty_1 ) , "::" , stringify ! (
                buffer ) ));
}
impl Default for TPM2B_PUBLIC_KEY_RSA__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_TPM2B_PUBLIC_KEY_RSA() {
    assert_eq!(::std::mem::size_of::<TPM2B_PUBLIC_KEY_RSA>() , 258usize ,
               concat ! ( "Size of: " , stringify ! ( TPM2B_PUBLIC_KEY_RSA )
               ));
    assert_eq! (::std::mem::align_of::<TPM2B_PUBLIC_KEY_RSA>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPM2B_PUBLIC_KEY_RSA ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_PUBLIC_KEY_RSA ) ) . t as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_PUBLIC_KEY_RSA )
                , "::" , stringify ! ( t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_PUBLIC_KEY_RSA ) ) . b as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_PUBLIC_KEY_RSA )
                , "::" , stringify ! ( b ) ));
}
impl Clone for TPM2B_PUBLIC_KEY_RSA {
    fn clone(&self) -> Self { *self }
}
impl Default for TPM2B_PUBLIC_KEY_RSA {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
pub type TPMI_RSA_KEY_BITS = TPM_KEY_BITS;
#[repr(C)]
#[derive(Copy)]
pub struct TPM2B_PRIVATE_KEY_RSA {
    pub t: __BindgenUnionField<TPM2B_PRIVATE_KEY_RSA__bindgen_ty_1>,
    pub b: __BindgenUnionField<TPM2B>,
    pub bindgen_union_field: [u16; 65usize],
}
#[repr(C)]
pub struct TPM2B_PRIVATE_KEY_RSA__bindgen_ty_1 {
    pub size: UINT16,
    pub buffer: [BYTE; 128usize],
}
#[test]
fn bindgen_test_layout_TPM2B_PRIVATE_KEY_RSA__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<TPM2B_PRIVATE_KEY_RSA__bindgen_ty_1>() ,
               130usize , concat ! (
               "Size of: " , stringify ! ( TPM2B_PRIVATE_KEY_RSA__bindgen_ty_1
               ) ));
    assert_eq! (::std::mem::align_of::<TPM2B_PRIVATE_KEY_RSA__bindgen_ty_1>()
                , 2usize , concat ! (
                "Alignment of " , stringify ! (
                TPM2B_PRIVATE_KEY_RSA__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_PRIVATE_KEY_RSA__bindgen_ty_1 ) ) .
                size as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_PRIVATE_KEY_RSA__bindgen_ty_1 ) , "::" , stringify ! (
                size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_PRIVATE_KEY_RSA__bindgen_ty_1 ) ) .
                buffer as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_PRIVATE_KEY_RSA__bindgen_ty_1 ) , "::" , stringify ! (
                buffer ) ));
}
impl Default for TPM2B_PRIVATE_KEY_RSA__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_TPM2B_PRIVATE_KEY_RSA() {
    assert_eq!(::std::mem::size_of::<TPM2B_PRIVATE_KEY_RSA>() , 130usize ,
               concat ! ( "Size of: " , stringify ! ( TPM2B_PRIVATE_KEY_RSA )
               ));
    assert_eq! (::std::mem::align_of::<TPM2B_PRIVATE_KEY_RSA>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPM2B_PRIVATE_KEY_RSA ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_PRIVATE_KEY_RSA ) ) . t as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_PRIVATE_KEY_RSA )
                , "::" , stringify ! ( t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_PRIVATE_KEY_RSA ) ) . b as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_PRIVATE_KEY_RSA )
                , "::" , stringify ! ( b ) ));
}
impl Clone for TPM2B_PRIVATE_KEY_RSA {
    fn clone(&self) -> Self { *self }
}
impl Default for TPM2B_PRIVATE_KEY_RSA {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPM2B_ECC_PARAMETER {
    pub t: __BindgenUnionField<TPM2B_ECC_PARAMETER__bindgen_ty_1>,
    pub b: __BindgenUnionField<TPM2B>,
    pub bindgen_union_field: [u16; 25usize],
}
#[repr(C)]
pub struct TPM2B_ECC_PARAMETER__bindgen_ty_1 {
    pub size: UINT16,
    pub buffer: [BYTE; 48usize],
}
#[test]
fn bindgen_test_layout_TPM2B_ECC_PARAMETER__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<TPM2B_ECC_PARAMETER__bindgen_ty_1>() ,
               50usize , concat ! (
               "Size of: " , stringify ! ( TPM2B_ECC_PARAMETER__bindgen_ty_1 )
               ));
    assert_eq! (::std::mem::align_of::<TPM2B_ECC_PARAMETER__bindgen_ty_1>() ,
                2usize , concat ! (
                "Alignment of " , stringify ! (
                TPM2B_ECC_PARAMETER__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_ECC_PARAMETER__bindgen_ty_1 ) ) .
                size as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_ECC_PARAMETER__bindgen_ty_1 ) , "::" , stringify ! (
                size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_ECC_PARAMETER__bindgen_ty_1 ) ) .
                buffer as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_ECC_PARAMETER__bindgen_ty_1 ) , "::" , stringify ! (
                buffer ) ));
}
impl Default for TPM2B_ECC_PARAMETER__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_TPM2B_ECC_PARAMETER() {
    assert_eq!(::std::mem::size_of::<TPM2B_ECC_PARAMETER>() , 50usize , concat
               ! ( "Size of: " , stringify ! ( TPM2B_ECC_PARAMETER ) ));
    assert_eq! (::std::mem::align_of::<TPM2B_ECC_PARAMETER>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( TPM2B_ECC_PARAMETER ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_ECC_PARAMETER ) ) . t as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_ECC_PARAMETER ) ,
                "::" , stringify ! ( t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_ECC_PARAMETER ) ) . b as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_ECC_PARAMETER ) ,
                "::" , stringify ! ( b ) ));
}
impl Clone for TPM2B_ECC_PARAMETER {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMS_ECC_POINT {
    pub x: TPM2B_ECC_PARAMETER,
    pub y: TPM2B_ECC_PARAMETER,
}
#[test]
fn bindgen_test_layout_TPMS_ECC_POINT() {
    assert_eq!(::std::mem::size_of::<TPMS_ECC_POINT>() , 100usize , concat ! (
               "Size of: " , stringify ! ( TPMS_ECC_POINT ) ));
    assert_eq! (::std::mem::align_of::<TPMS_ECC_POINT>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( TPMS_ECC_POINT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_ECC_POINT ) ) . x as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_ECC_POINT ) , "::"
                , stringify ! ( x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPMS_ECC_POINT ) ) . y as * const _ as
                usize } , 50usize , concat ! (
                "Alignment of field: " , stringify ! ( TPMS_ECC_POINT ) , "::"
                , stringify ! ( y ) ));
}
impl Clone for TPMS_ECC_POINT {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct TPM2B_ECC_POINT {
    pub t: __BindgenUnionField<TPM2B_ECC_POINT__bindgen_ty_1>,
    pub b: __BindgenUnionField<TPM2B>,
    pub bindgen_union_field: [u16; 51usize],
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPM2B_ECC_POINT__bindgen_ty_1 {
    pub size: UINT16,
    pub point: TPMS_ECC_POINT,
}
#[test]
fn bindgen_test_layout_TPM2B_ECC_POINT__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<TPM2B_ECC_POINT__bindgen_ty_1>() ,
               102usize , concat ! (
               "Size of: " , stringify ! ( TPM2B_ECC_POINT__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<TPM2B_ECC_POINT__bindgen_ty_1>() ,
                2usize , concat ! (
                "Alignment of " , stringify ! ( TPM2B_ECC_POINT__bindgen_ty_1
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_ECC_POINT__bindgen_ty_1 ) ) . size
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_ECC_POINT__bindgen_ty_1 ) , "::" , stringify ! ( size )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_ECC_POINT__bindgen_ty_1 ) ) . point
                as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                TPM2B_ECC_POINT__bindgen_ty_1 ) , "::" , stringify ! ( point )
                ));
}
impl Clone for TPM2B_ECC_POINT__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_TPM2B_ECC_POINT() {
    assert_eq!(::std::mem::size_of::<TPM2B_ECC_POINT>() , 102usize , concat !
               ( "Size of: " , stringify ! ( TPM2B_ECC_POINT ) ));
    assert_eq! (::std::mem::align_of::<TPM2B_ECC_POINT>() , 2usize , concat !
                ( "Alignment of " , stringify ! ( TPM2B_ECC_POINT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_ECC_POINT ) ) . t as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_ECC_POINT ) ,
                "::" , stringify ! ( t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPM2B_ECC_POINT ) ) . b as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPM2B_ECC_POINT ) ,
                "::" , stringify ! ( b ) ));
}
impl Clone for TPM2B_ECC_POINT {
    fn clone(&self) -> Self { *self }
}
impl Default for TPM2B_ECC_POINT {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
pub type TPMI_ALG_ECC_SCHEME = TPM_ALG_ID;
pub type TPMI_ECC_CURVE = TPM_ECC_CURVE;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct TPMT_ECC_SCHEME {
    pub scheme: TPMI_ALG_ECC_SCHEME,
    pub details: TPMU_ASYM_SCHEME,
}
#[test]
